{"Diane Abbott": {"2018-06-04": {"Employment and earnings": ["9 October 2017, received £1,500 from Avalon Television, 4A Exmoor St, London W10 6BD, for an appearance on the Russell Howard Hour television show. Hours: 3 hrs. (Registered 07 November 2017)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Mahir Kilic Address of donor: private Amount of donation or nature and value if donation in kind: £2,723 Donor status: individual (Registered 07 July 2017)", "Name of donor: RMT Address of donor: Unity House, 39 Chalton Street, London NW1 1JD Amount of donation or nature and value if donation in kind: £2,500 Donor status: trade union (Registered 07 July 2017)", "Name of donor: Unite Address of donor: 128 Theobalds Road, London WC1X 8TN Amount of donation or nature and value if donation in kind: £2,000 Donor status: trade union (Registered 07 July 2017)"], "Miscellaneous": ["Since December 2015, a trustee of the Diane Abbott Foundation, which works to excel and improve education. (Registered 26 October 2016)"]}}, "Debbie Abrahams": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: UNISON Address of donor: 130 Euston Road, London NW1 2AY Amount of donation or nature and value if donation in kind: Secondment, via the Labour Party, of a researcher for 2 days a week from 7 April 2017 to 6 April 2018; value £18,827.12. This is to support me in my Shadow front bench role. Donor status: trade union (Registered 05 July 2017)", "Name of donor: UNISON Address of donor: 130 Euston Road, London NW1 2AY Amount of donation or nature and value if donation in kind: £3,000 Donor status: trade union (Registered 07 July 2017)", "Name of donor: Unite the Union Address of donor: Merchants Quay, Salford Quays, Salford M50 3SG Amount of donation or nature and value if donation in kind: Franking of post to value of £1,212.58 Donor status: trade union (Registered 07 July 2017)", "Name of donor: Unite the Union Address of donor: 128 Theobold’s Road Holborn, London WC1X 8TN Amount of donation or nature and value if donation in kind: £6,000 Donor status: trade union (Registered 07 July 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Joint ownership with my daughter of terraced house in Nottingham: (i)."]}}, "Nigel Adams": {"2018-06-04": {"(b) Any other support not included in Category 2(a)": ["Name of donor: Mr C D Forbes Adam Address of donor: private Amount of donation or nature and value if donation in kind: £3,000 Date received: 2 June 2017 Date accepted: 2 June 2017 Donor status: individual (Registered 27 June 2017)", "Name of donor: George Hollingbery Address of donor: private Amount of donation or nature and value if donation in kind: £3,000 Date received: 29 June 2017 Date accepted: 29 June 2017 Donor status: individual (Registered 24 July 2017)", "Name of donor: Michael O'Neill Address of donor: private Amount of donation or nature and value if donation in kind: £3,000 Date received: 18 July 2017 Date accepted: 18 July 2017 Donor status: private (Registered 24 July 2017)", "Name of donor: Mr Alexander Temerko Address of donor: private Amount of donation or nature and value if donation in kind: £2,500 Date received: 11 August 2017 Date accepted: 11 August 2017 Donor status: individual (Registered 11 August 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: PRS for Music (Performing Rights Society) Address of donor: 2 Pancras Square, London N1C 4AG Amount of donation or nature and value if donation in kind: In my capacity as Chairman of the All Party Parliamentary Group for Music, I received two tickets and accommodation at Glastonbury music festival to the value of £1,019.46 Date received: 22 June 2017 Date accepted: 23 June 2017 Donor status: company, registration 03444246 (Registered 18 July 2017)", "Name of donor: UK Music (2009) Ltd Address of donor: 49 Whitehall, London SW1A 2BX Amount of donation, or nature and value if donation in kind: One ticket to attend the Hyundai Mercury Prize Awards event to the value of £570 (inc VAT) Date received: 14 September 2017 Date accepted: 14 September 2017 Donor status: company, registration 03245288 (Registered 26 October 2017)", "Name of donor: Ladbrokes Coral Group Address of donor: 5th Floor, The Zig Zag Building, 70 Victoria Street, London SW1E 6SQ Amount of donation, or nature and value if donation in kind: two tickets with hospitality to York Racecourse, value £500 (£250 each) Date received: 14 October 2017 Date accepted: 14 October 2017 Donor status: company, registration 00566221 (Registered 26 October 2017)", "Name of donor: William Hill plc Address of donor: Greenside House, 50 Station Road, London N22 7TP Amount of donation, or nature and value if donation in kind: two tickets to Alexandra Palace to participate in the annual Parliamentary charity darts competition; total value £524 (£262 each). Date received: 21 December 2017 Date accepted: 21 December 2017 Donor status: company, registration 04212563 (Registered 22 January 2018)", "Name of donor: William Hill plc Address of donor: Greenside House, 50 Station Road, London N22 7TP Amount of donation, or nature and value if donation in kind: two tickets for myself and a member of staff to Cheltenham Racecourse including hospitality; total value £540 (£270each) Date received: 16 March 2018 Date accepted: 16 March 2018 Donor status: company, registration 04212563 (Registered 29 May 2018)"], "Visits outside the UK": ["Name of donor: Drax Power Ltd Address of donor: Drax Power Station, Drax, Selby YO8 8PH Estimate of the probable value (or amount of any donation): Air travel and accommodation with a value of approximately £9,100 Destination of visit: USA Dates of visit: 7-10 October 2017 Purpose of visit: to attend the seventh United States Industrial Pellet Association Conference and deliver keynote speech. (Registered 26 October 2017)", "Name of donor: (1) Lords and Commons Cricket Club; (2) Liberty OneSteel Address of donor: (1) House of Commons, London SW1A 0AA; (2) 205 Pacific Hwy, St Leonards, NSW 2065, Australia Amount of donation (or estimate of the probable value): (1) £985 towards in country accommodation costs; (2) Hospitality at a reception on 31 December 2017, estimated value £200 Destination of visit: Melbourne and Sydney, Australia Date of visit: 27 December 2017 – 6 January 2018 Purpose of visit: to participate in an inter-parliamentary cricket tournament and to raise funds for two local charities. (Registered 19 January 2018)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["One mixed use commercial and residential property in Selby, North Yorkshire, co-owned with my wife: (i) and (ii).", "Two residential properties in York co-owned with my wife, the second of which was acquired in September 2017: (i) and (ii). (Registered 13 May 2015; updated 10 October 2017)", "From 18 March 2016, one residential property in Leeds co-owned with my wife: (i) and from 10 May 2016 (ii). (Registered 18 March 2016; updated 10 May 2016)"], "Miscellaneous": ["Unpaid director of NGC Networks Ltd and NGC Network Services Ltd, and company secretary of the latter. I also have a shareholding, which is below the registrable level, in each company. (Registered 11 October 2016; updated 23 March 2017)"], "Family members employed and paid from parliamentary expenses": ["I employ my spouse, Claire Adams, as part-time Office Manager."]}}, "Bim Afolami": {"2018-06-04": {"Employment and earnings": ["11 January 2018, payment of £250 from Four Communications, 20 Thomas Street, London SE1 9BF, for participating in a panel event. Hours: 2 hrs including preparation. Fee paid direct to charity. (Registered 30 January 2018)", "From 1 February 2018 until further notice, adviser to the Association of Independent Professionals and Self-employed, Heron House, 10 Dean Farrar Street, London SW1H 0DX. I will receive £1,500 a month for providing ad hoc advice on policy and general political issues. Hours: 8-10 hrs per month. (Registered 01 February 2018)", "2 February 2018, payment of £400 from Queenswood School, Shepherds Way, Brookmans Park, Hatfield AL9 6NS, for a speaking engagement. Hours: 2 hrs including preparation. Fee paid direct to charity. (Registered 02 February 2018)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Peter Cruddas Address of donor: private Amount of donation or nature and value if donation in kind: £5,000 for my election campaign Donor status: individual (Registered 06 July 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: Peter Cruddas Address of donor: private Amount of donation or nature and value if donation in kind: Ticket to the Conservative Summer Party, value £1,500 Date received: 5 July 2017 Date accepted: 5 July 2017 Donor status: individual (Registered 06 July 2017)"], "Visits outside the UK": ["Name of donor: (1) Great Britain China Centre (with sponsorship from BP and Prudential)  (2) International Liaison Department of the Chinese Communist Party (IDCPC) Address of donor: (1) 15 Belgrave Square, London SW1X 8PS  (2) No.4 Fuxing Road, Beijing Estimate of the probable value (or amount of any donation): (1) Airfare £1,441; hotel and breakfast in Beijing and Wuhan £402.21; total £1,843.21  (2) train fare to Wuhan £95.76; food and drink (estimated at £60/day) £240; domestic travel (estimated at £10/day) £40; total £375.76 Destination of visit: Beijing and Wuhan, China Dates of visit: 8-13 April 2018 Purpose of visit: To attend the 2018 UK-China Leadership Forum, organised by the Great Britain China Centre and IDCPC; to engage with Chinese Communist Officials on a broad range of topics and to strengthen UK-China bilateral relations. (Registered 26 April 2018)"], "Miscellaneous": ["Member (unpaid) of the Ditchley Foundation's Programme Committee. (Registered 06 July 2017)", "From June 2017, Member (unpaid) of the Court of the University of Bedfordshire. (Registered 30 January 2018)"]}}, "Adam Afriyie": {"2018-06-04": {"(i) Shareholdings: over 15% of issued share capital": ["Axonn Media Ltd; news and information services company.", "Until 1 June 2017, Connect Support Services Ltd; IT services company. (Updated 07 July 2017)", "Brafton Media Incorporated; news and information services company.", "Senate Media Ltd (formerly Adfero Media Ltd); digital animation, video and infographic company. (Registered 26 March 2013; updated 20 February 2017)", "Castleford Media Pty Ltd; news and information services company. (Registered 20 February 2017)"]}}, "Peter Aldous": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: United and Cecil Club Address of donor: New Penderel House, 283-287 High Holborn, London WC1A 7HF Amount of donation or nature and value if donation in kind: £2,500 Donor status: members' association (Registered 06 July 2017)", "Name of donor: Kingsley Healthcare Ltd Address of donor: Kingsley House, Clapham Road, South Lowestoft NR32 1QS Amount of donation or nature and value if donation in kind: £2,000 Donor status: company, registration 06499955 (Registered 06 July 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Partner in a family farm in Halesworth, Suffolk: (i) and (ii).", "Interest in a farm near Ipswich, Suffolk: (i) and (ii). (Updated 12 July 2017)"]}}, "Rushanara Ali": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Bamfords Trust plc Address of donor: Church Down Chamber, Bordyke, Tunbridge TN9 1NR Amount of donation, or nature and value if donation in kind: £5,000 Donor status: company, registration 1516209 (Registered 07 July 2017)", "Name of donor: Nurun Nabi Address of donor: private Amount of donation, or nature and value if donation in kind: £2,000 Donor status: individual (Registered 07 July 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: Uprising Leadership Address of donor: 2nd Floor, Tayside House, 31 Pepper Street, London E14 9RP Amount of donation, or nature and value if donation in kind: Ticket, subsistence and travel to the British American Project Conference in Manchester, where I spoke on behalf of Uprising Leadership (a charitable organisation); total value £595.13 Date received: 10-13 November 2017 Date accepted: 10 November 2017 Donor status: company, registration 8252639 (Registered 21 December 2017)", "Name of donor: Franco-British Colloque Address of donor: 86 East Lane, West Horsley, Leatherhead KT24 6LQ Amount of donation, or nature and value if donation in kind: Food and accommodation while attending the Franco-British Colloque’s 2018 Conference, total value £777.60 Date received: 18-20 January 2018 Date accepted: 18 January 2018 Donor status: company, registration 06913437 (Registered 14 February 2018)", "Name of donor: Canary Wharf Group Address of donor: One Canada Square, Canary Wharf, London E14 5AB Amount of donation, or nature and value if donation in kind: Two tickets for a football match at West Ham Stadium, which included dinner, total value £800 Date received: 10 May 2018 Date accepted: 10 May 2018 Donor status: company, registration 4191122 (Registered 22 May 2018)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Two residential properties in London: (i) and (ii). (Registered 16 September 2014)"]}}, "Lucy Allan": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Besblock Ltd Address of donor: Halesfield 21, Telford TF7 4NF Amount of donation or nature and value if donation in kind: £5,000 Donor status: company, registration 01059042 (Registered 27 June 2017)", "Name of donor: J C Bamford Excavators Ltd Address of donor: 3 High Street, Bassingham, Lincolnshire LN5 9JZ Amount of donation or nature and value if donation in kind: £3,000 Donor status: company, registration 00561597 (Registered 27 June 2017)"]}}, "Heidi Allen": {"2018-06-04": {"Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["House in London, owned jointly with my husband: (i). (Registered 22 May 2015)"], "(i) Shareholdings: over 15% of issued share capital": ["RS Bike Paint Ltd, a paint manufacturing company, of which I am unremunerated director. (Registered 22 May 2015)"], "Miscellaneous": ["From August 2017, a trustee of the charity Feeding Britain. (Registered 25 September 2017)"]}}, "Rosena Allin-Khan": {"2018-06-04": {"Employment and earnings": ["Payments received from St George's Hospital NHS Trust, Blackshaw Road, Tooting, London SW17 0QT, for my work as a doctor:", "11 May 2017, received £297.84 for two shifts, on 15 and 17 April 2017. Hours: 24 hrs in total. (Registered 17 July 2017)", "Councillor for Wandsworth Council, The Town Hall, Wandsworth High Street, London SW18 2PU. From July 2017 I receive £883.08 (gross) a month. Hours: approx. 10 hrs a week. (Registered 17 July 2017; updated 13 November 2017)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: BWTUC Address of donor: 68 Clapham Manor St, London SW4 6DZ Amount of donation, or nature and value if donation in kind: £15,000 Donor status: trade union (Registered 17 July 2017)", "Name of donor: GMB Address of donor: Cooper House, 205 Hook Rd, Chessington KT9 1EA Amount of donation, or nature and value if donation in kind: £12,500 Donor status: trade union (Registered 17 July 2017)"], "(b) Any other support not included in Category 2(a)": ["Name of donor: Jo Rigby Address of donor: private Amount of donation, or nature and value if donation in kind: £4,000 Date received: 24 April 2017 Date accepted: 1 May 2017 Donor status: individual (Registered 17 July 2017)", "Name of donor: Bill Bottriell Address of donor: private Amount of donation, or nature and value if donation in kind: £5,000 Date received: 2 May 2017 Date accepted: 3 May 2017 Donor status: individual (Registered 17 July 2017)", "Name of donor: Nick Harrison Address of donor: private Amount of donation, or nature and value if donation in kind: £3,000 Date received: 2 May 2017 Date accepted: 3 May 2017 Donor status: individual (Registered 17 July 2017)", "Name of donor: Stop The Tory Landslide Fund Address of donor: c/o Crowdpac, 68-80 Hanbury Street, London E1 5JL Amount of donation, or nature and value if donation in kind: £5,000 Date received: 2 May 2017 Date accepted: 3 May 2017 Donor status: unincorporated association (Registered 17 July 2017; updated 03 October 2017)", "Name of donor: More United Address of donor: 32 Great Peter St, London SW1P 2DB Amount of donation, or nature and value if donation in kind: £10,000 Date received: 4 May 2017 Date accepted: 5 May 2017 Donor status: company, registration 10285790 (Registered 17 July 2017)", "Name of donor: Criterion Capital Address of donor: 16 Babmaes St, London SW1Y 6HD Amount of donation, or nature and value if donation in kind: £2,500 Date received: 5 May 2017 Date accepted: 8 May 2017 Donor status: company, registration 05887591 (Registered 17 July 2017)"], "Visits outside the UK": ["Name of donor: Oxfam Address of donor: Oxfam House, John Smith Drive, Cowley OX24 2JY Estimate of the probable value (or amount of any donation):  Flights valued at £530.06; accommodation valued at £383.40; meals, transport and visas valued at £315.55; total value £1,229.01 Destination of visit: Amman, Jordan Dates of visit: 12 to 16 February 2017 Purpose of visit: To visit a refugee camp in Zaatari and Syrian refugees in Jordan. (Registered 17 July 2017)", "Name of donor: The Belvedere Polish-British forum Address of donor: c/o British Embassy, ul. Kawalerii 12,00 – 468 Warsaw, Poland Estimate of the probable value (or amount of any donation): Flights, internal travel, accommodation and hospitality, approx. value £330 Destination of visit: Warsaw Dates of visit: 8-9 March 2017 Purpose of visit: To promote Anglo/Polish relations. (Registered 17 July 2017)", "Name of donor: Ministry of Foreign Affairs, Qatar Address of donor: Qatar Embassy, 1 South Audley St, London W1K 1NB Estimate of the probable value (or amount of any donation): Air travel, food and accommodation to a value of £4,200 Destination of visit: Qatar Dates of visit: 13-17 February 2018 Purpose of visit: British-Qatar APPG visit to meet Ministers and officials, discussing workers rights while working on the construction of World Cup stadia in preparation for Qatar 2022, in line with my Shadow Minister for Sport duties. (Registered 22 February 2018)"]}}, "Mike Amesbury": {"2018-06-04": {"Employment and earnings": ["20 June 2017, received £15,700 from Manchester City Council, Albert Square, Manchester Town Hall M60 2LA, for previous role as a City Councillor. Resigned on 26 June 2017. Hours: 60 hrs. (Registered 30 June 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Two bedroom terraced house in Manchester: (i). (Registered 30 June 2017)"]}}, "David Amess": {"2018-06-04": {"Employment and earnings": ["Until further notice, I am Parliamentary Adviser to the Caravan Club, East Grinstead House, East Grinstead, West Sussex RH19 1UA. I receive £6,000 a year in return for an expected commitment of 100 hours. (Updated 5 June 2015)", "28 November 2017, received £450 from Dods Group, 11th Floor, The Shard, 32 London Bridge Street, London SE1 9SG, for Q&A sessions. Hours: 8 hrs. (Registered 11 December 2017)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: 97 Dining Club Address of donor: 810 London Road, Leigh-on-Sea SS9 3NH Amount of donation or nature and value if donation in kind: £11,500 Donor status: unincorporated association (Registered 30 June 2017)", "Name of donor: 1912 Club Address of donor: 116 Valley Road, Chorleywood, Herts, WD3 4BH Amount of donation or nature and value if donation in kind: £1,600 Donor status: unincorporated association (Registered 30 June 2017)"], "Visits outside the UK": ["Name of donor: Welle-verein fur Menschenrechte und Freiheit Address of donor: Postfach 1764, 8048 Zurich Destination of visit: Paris Estimate of the probable value (or amount of any donation): flight tickets: £426; hotel: £74; total: £500 Dates of visit: 1 July 2017 Purpose of visit: NCRI Free Iran Rally Paris Conference. (Registered 04 August 2017)", "Name of donor: Ministry of Foreign Affairs, Qatar Address of donor: Qatar Embassy, 1 South Audley St, London W1K 1NB Estimate of the probable value (or amount of any donation): Travel and accommodation with a value of £4,600 Destination of visit: Qatar Dates of visit: 13-18 February 2018 Purpose of visit: British-Qatar APPG visit to meet Ministers and officials, discuss GCC crisis, and discuss bilateral relations and regional issues. (Registered 22 February 2018)"], "Miscellaneous": ["Chair of Board of Trustees of the Industry and Parliament Trust. (Updated 11 July 2014)", "Chairman of the Industry and Parliament Fellowship Committee."], "Family members employed and paid from parliamentary expenses": ["I employ my wife, Julia Amess, as part-time Secretary/Caseworker."]}}, "Stuart Andrew": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: United and Cecil Club Address of donor: 283-287 High Holborn, London, WC1V 7HF Amount of donation or nature and value if donation in kind: £2,500 Donor status: members' association (Registered 06 July 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["House in Leeds: (i) and (ii)."]}}, "Tonia Antoniazzi": {"2018-06-04": {"Employment and earnings": ["30 June 2017, received £937.93 from Carmarthenshire County Council, County Hall, Carmarthen SA31 1JP, for work as a modern foreign languages teacher before my election. Hours: none since my election. (Registered 03 July 2017)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: UNISON Address of donor: 130 Euston Road, London NW1 2AY Amount of donation or nature and value if donation in kind: £5,000 towards my election campaign Donor status: trade union (Registered 06 July 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: William Hill plc Address of donor: Greenside House, 50 Station Road, Wood Green, London N22 7TP Amount of donation, or nature and value if donation in kind: A pass for myself (value £61.20) and a hospitality ticket for a member of staff (value £264) for the William Hill Professional Darts Championship at Alexandra Palace, total value £325.20. At the same event, as a tournament prize, William Hill plc pledged a donation of £750 to my nominated charity. Date received: 21 December 2017 Date accepted: 21 December 2017 Donor status: company, registration 04212563 (Registered 23 January 2018; updated 16 February 2018)", "Name of donor: William Hill plc Address of donor: Greenside House, 50 Station Road, Wood Green, London N22 7TP Amount of donation, or nature and value if donation in kind: Two hospitality tickets for the William Hill Professional Darts Championship at Alexandra Palace, total value £768 (£384 each). Date received: 1 January 2018 Date accepted: 1 January 2018 Donor status: company, registration 04212563 (Registered 16 February 2018)", "Name of donor: William Hill plc Address of donor: Greenside House, 50 Station Road, Wood Green, London N22 7TP Amount of donation, or nature and value if donation in kind: Two tickets to a boxing match in Cardiff, total value £600 Date received: 31 March 2018 Date accepted: 31 March 2018 Donor status: company, registration 04212563 (Registered 08 May 2018)"]}}, "Edward Argar": {"2018-06-04": {"No records held": "Nil"}}, "Jon Ashworth": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Unite the Union Address of donor: 128 Theobalds Road, London WC1X 8TN Amount of donation or nature and value if donation in kind: reimbursement of £503.26 for refreshments at a Shadow Health Team Reception Donor status: trade union (Registered 22 June 2017)", "Name of donor: Unite the Union Address of donor: 128 Theobalds Road, London WC1X 8TN Amount of donation or nature and value if donation in kind: freepost costing £1,520 Donor status: trade union (Registered 07 July 2017)", "Name of donor: Unite the Union Address of donor: 128 Theobalds Road, London WC1X 8TN Amount of donation or nature and value if donation in kind: freepost costing £1,296 Donor status: trade union (Registered 07 July 2017)", "Name of donor: Unite the Union Address of donor: 128 Theobalds Road, London WC1X 8TN Amount of donation or nature and value if donation in kind: £1,666.38 received by my CLP to cover the cost of 2017 Christmas cards and postage Donor status: trade union (Registered 13 February 2018)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: Hospital Caterers Association Address of donor: Progressive House, 2 Maidstone Road, Sidcup DA14 5HZ Amount of donation, or nature and value if donation in kind: Travel associated with the Hospital Caterers’ Association National Leadership and Development Forum 2018 in Newport, total value £426 Date received: 12 April 2018 Date accepted: 12 April 2018 Donor status: unincorporated association (Registered 25 April 2018)"], "Visits outside the UK": ["Name of donor: Policy Network and Communications Ltd Address of donor: 11 Tufton Street, London, SW1P 3QB Estimate of the probable value (or amount of any donation): Flights costing £252.27; hotel costs of £111.51; ground transportation costing £67.70; total value £431.43 Destination of visit: Berlin, Germany Date of visit:  3 to 4 July 2017 Purpose of visit: To attend and participate in the Progressive Governance Symposium 2017 with leading politicians, academics and policymakers from across Europe and north America. (Registered 08 August 2017)", "Name of donor: Policy Network and Communications Ltd Address of donor: 11 Tufton Street, London SW1P 3QB Estimate of the probable value (or amount of any donation): Flights £699.07; hotel £301.39; meals £150; total value £1,150.46. Destination of visit: Montreal, Canada Dates of visit: 15 - 17 September 2017 Purpose of visit: To attend and participate in the Global Progress Summit Symposium 2017 with international leading politicians, academics and policymakers. (Registered 19 October 2017)"]}}, "Victoria Atkins": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Mr John Lewis Address of donor: private Amount of donation or nature and value if donation in kind: £2,500 Donor status: individual (Registered 06 July 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: British Sugar Address of donor: Sugar Way, Peterborough PE2 9AY Amount of donation or nature and value if donation in kind: four nights' hotel accommodation for myself and my husband during the Conservative Party conference, value £1,120 Date received: 4 - 8 October 2017 Date accepted: 4 October 2017 Donor status: company, registration 315158 (Registered 30 October 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Flat in London: (i) and (ii). (Registered 6 June 2015; updated 22 July 2015)", "From 13 April 2018, house in London: (i) and (ii). (Registered 19 April 2018)"], "Miscellaneous": ["Barrister, currently not practising. (Registered 06 June 2015)"], "Family members engaged in lobbying the public sector on behalf of a third party or client": ["Brother, James Atkins, is Managing Director of Strategy, Business Development and Digital for Europe, the Middle East and Africa, and Deputy Chairman of Public Affairs for Europe, the Middle East and Africa at Burson-Marsteller. (Registered 06 June 2015)"]}}, "Ian Austin": {"2018-06-04": {"(b) Any other support not included in Category 2(a)": ["Name of donor: Sir Trevor Chinn Address of donor: private Amount of donation or nature and value if donation in kind: £5,000 Date received: 27 April 2017 Date accepted: 27 April 2017 Donor status: individual (Registered 15 June 2017)", "Name of donor: GMB Address of donor: Will Thorne House, 2 Birmingham Road, Halesowen B63 3HP Amount of donation or nature and value if donation in kind: £10,000 Date received: 28 April 2017 Date accepted: 28 April 2017 Donor status: trade union (Registered 15 June 2017)", "Name of donor: Sir David Garrard Address of donor: private Amount of donation or nature and value if donation in kind: £10,000 Date received:  9 May 2017 Date accepted: 9 May 2017 Donor status: individual (Registered 15 June 2017)"], "Visits outside the UK": ["Name of donor: Labour Friends of Israel Address of donor: BM LFI, London WC1N 3XX Estimate of the probable value (or amount of any donation): flights, accommodation, meals, airport and taxi transfers, with a value of £1,500 Destination of visit: Washington DC, USA Dates of visit: 23-28 March 2017 Purpose of visit: To attend meetings and the American Israel Public Affairs Committee Conference. (Registered 12 September 2017)", "Name of donor: Nokan Group Address of donor: 48, 2 Salim, 111 Shaheed Aram, Sulaimanya, Kurdistan Region, Iraq Estimate of the probable value (or amount of any donation): Flights, internal transport, hotels and meals with a value of approx. £3,428 Destination of visit: Erbil, Kirkuk and Slemani, Kurdistan Region in Iraq Dates of visit: 22-28 September 2017 Purpose of visit: Kurdistan APPG visit to observe the referendum and meet party, UK business and church leaders, NGOs, British Consul staff, UK forces training Peshmerga, managers and residents of a camp for internally displaced people. (Registered 24 October 2017)", "Name of donor: United Arab Emirates Ministry of Foreign Affairs Address of donor: Al Bateen, Abu Dhabi, United Arab Emirates Estimate of the probable value (or amount of any donation): Travel and accommodation with a value of £3,800 Destination of visit: United Arab Emirates Dates of visit: 10-16 February 2018 Purpose of visit: To attend the World Government Summit, meet with Government Ministers, Members of the Federal National Council and senior business figures, in order to build on the bilateral relationship. (Registered 22 February 2018)", "Name of donor: March of the Living UK Address of donor: 1 Chalgrove Gardens, London N3 3PL Estimate of the probable value (or amount of any donation): Flights, travel, accommodation and meals with a total value of £1,235 Destination of visit: Poland Dates of visit: 9-12 April 2018 Purpose of visit: Visit to Poland to participate in the international March of the Living between Auschwitz and Birkenau, as well as visiting other Holocaust sites across the country. (Registered 30 April 2018)"]}}, "Richard Bacon": {"2018-06-04": {"Visits outside the UK": ["Name of donor: Conservative Middle East Council Address of donor: 55 Tufton Street, London SW1P 3QL Amount of donation (or estimate of the probable value): accommodation, food and transport with a total value of £2,248 Destination of visit: Lebanon Date of visit: 20-24 April 2017 Purpose of visit: Parliamentary fact finding. (Registered 14 December 2017)", "Name of donor: Government of the Islamic Republic of Iran Address of donor: Embassy of Iran, 16 Princes Gate, London SW7 1PT Amount of donation (or estimate of the probable value): transport, food and two nights' accommodation with a total value of £867. (The remaining accommodation was provided by a non-registrable source.) Destination of visit: Iran Date of visit: 4 – 10 August 2017 Purpose of visit: To attend the Inauguration of H.E. Hassan Rouhani as President of the Islamic Republic of Iran and to meet Iranian parliamentarians. (Registered 14 December 2017)", "Name of donor: Ministry of Defence, Kingdom of Saudi Arabia Address of donor: Riyadh, Postal Code 111165, Kingdom of Saudi Arabia Estimate of the probable value (or amount of any donation): flights, accommodation, internal transport and food at a total value of £8,257 Destination of visit: Riyadh and Saudi/Yemen border region Dates of visit: 11-15 January 2018 Purpose of visit: Parliamentary delegation to see impact of ballistic missile strikes in the Saudi/Yemen border region and gain a deeper understanding of the strategic importance of the Coalition operations in Yemen. (Registered 06 March 2018)"], "Miscellaneous": ["I am a patron of Elizabeth’s Legacy of Hope, a registered charity in England and Wales, No 1141287. During the course of overseas visits I may from time to time undertake engagements on behalf of the charity. (Registered 25 January 2013; updated 26 May 2015)", "I am a member of the board (unpaid) of the Right to Build Task Force, which is part of the National Custom and Self-Build Association, and I serve as the task force ambassador. (Registered 06 March 2018)"]}}, "Kemi Badenoch": {"2018-06-04": {"Employment and earnings": ["27 June 2017, received £2,375.57 as a Member of the London Assembly, City Hall, The Queens Walk, London SE1 2AA. Hours: none since my election. (Registered 29 June 2017)", "11 August 2017, received £150 from the BBC, Whiteladies Road, Bristol BS8 2LR, for contributing to a radio programme. Hours: 3 hrs. (Registered 08 September 2017)", "Payments from the Telegraph Media Group, 111 Buckingham Palace Road, London SW1W 0DT:", "8 September 2017, received £270 for an article. Hours: 3 hrs. (Registered 08 September 2017)", "1 November 2017, received £350 for an article. Hours: 3.5 hrs. (Registered 08 November 2017)", "Payment of £250 expected for an article written on 9 May 2018. Hours: 2.5 hrs. (Registered 04 June 2018)"], "Miscellaneous": ["From 8 January 2018, Vice Chairman of the Conservative Party. This post carries a part time salary. (Registered 05 February 2018)"]}}, "Adrian Bailey": {"2018-06-04": {"Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Two holiday properties in Cornwall, jointly owned with my wife: (i) and (ii)."]}}, "Steven Baker": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Jon P. Moynihan Address of donor: private Amount of donation or nature and value if donation in kind: £5,000 Donor status: individual (Registered 21 June 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: Jardentome Ltd Address of donor: Wicksteed Leisure Ltd, Digby Street, Kettering, Northamptonshire NN16 8YJ Amount of donation or nature and value if donation in kind: From June 2017 to May 2018, accommodation in London, approx. value £1,105 per calendar month; £13,260 a year. Date received: 19 June 2017 to May 2018 Date accepted: 19 June 2017 Donor status: company, registration 02353697 (Registered 27 June 2017)"], "(ii) Other shareholdings, valued at more than £70,000": ["From 31 May 2017, Glint Pay Ltd; financial services holding company. (Registered 22 June 2017)"]}}, "Harriett Baldwin": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Paul Farrer Address of donor: private Amount of donation or nature and value if donation in kind: £2,000 Donor status: individual (Registered 15 June 2017)"]}}, "Stephen Barclay": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Mr John P Foster Address of donor: private Amount of donation or nature and value if donation in kind: £10,000 Donor status: individual (Registered 07 July 2017)"]}}, "Hannah Bardell": {"2018-06-04": {"(b) Any other support not included in Category 2(a)": ["Name of donor: John Ward Address of donor: private Amount of donation or nature and value if donation in kind: £1,000 Date received: 3 May 2017 Date accepted: 3 May 2017 Donor status: individual (Registered 07 July 2017)", "Name of donor: John Ward Address of donor: private Amount of donation or nature and value if donation in kind: £1,000 Date received: 1 June 2017 Date accepted: 1 June 2017 Donor status: individual (Registered 07 July 2017)", "Name of donor: Gerarld Burns Address of donor: private Amount of donation or nature and value if donation in kind: £4,600 Date received: 2 June 2017 Date accepted: 2 June 2017 Donor status: individual (Registered 07 July 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: DIVA - Twin Media Group Ltd Address of donor: Room 32, Spectrum House, 32-34 Gordon House Road, London NW5 1LP Amount of donation, or nature and value if donation in kind: Trip to the DIVA Literature Festival, including weekend VIP ticket £150 and accommodation £240, total value £390 Date received: 3-4 November 2017 Date accepted: 3 November 2017 Donor status: company, registration 10207749 (Registered 17 January 2018)"]}}, "John Baron": {"2018-06-04": {"Employment and earnings": ["Until further notice, £600 a month for an investment column in the FT’s Investors' Chronicle magazine. Address: Number One Southwark Bridge, London SE1 9HL. All fees are waived in lieu of FT donations to charities of Mr Baron’s choice. Hours: 1 hr a month (1 column). (Updated 22 June 2015 and 11 August 2016)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Two investment residential properties (one house, one flat) in London: (i) and (ii). (Updated 5 December 2012)"], "(i) Shareholdings: over 15% of issued share capital": ["Equi Ltd; reporting on the progress of seven real investment trust portfolios. (Registered 05 July 2017)"]}}, "Kevin Barron": {"2018-06-04": {"Gifts, benefits and hospitality from UK sources": ["Name of donor: The Football Foundation Address of donor: Whittington House, 19-30 Alfred Pl, London WC1E 7EA Amount of donation, or nature and value if donation in kind: Ticket to attend a football match at Wembley on 27 March 2018, and associated hospitality; total value £500 Date received: 27 March 2018 Date accepted: 27 March 2018 Donor status: company, number 03876305 (Registered 24 April 2018)"], "Visits outside the UK": ["Name of donor: Sigma Pharmaceuticals plc Address of donor: Unit 1-7 Colonial Way, PO Box 233, Watford WD24 4YR Estimate of the probable value (or amount of any donation): Travel and accommodation for myself at an estimated value of £2,820 Destination of visit: Borneo Dates of visit: 11-13 February 2018 Purpose of visit: To attend the two day conference and to deliver a key note speech (including Q & A session) as Chair of the All Party Parliamentary Pharmacy Group. (Registered 26 February 2018)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Constituency office in Dinnington: (i)."]}}, "Guto Bebb": {"2018-06-04": {"(b) Any other support not included in Category 2(a)": ["Name of donor: United and Cecil Club Address of donor: c/o Beckfield, Crouch Lane, Winkfield, Windsor SL4 4TN Amount of donation or nature and value if donation in kind: £2,500 Date received: 3 May 2017 Date accepted: 3 May 2017 Donor status: members' association (Registered 04 July 2017)", "Name of donor: Mr Alexander Temerko Address of donor: private Amount of donation or nature and value if donation in kind: £5,000 Date received: 8 May 2017 Date accepted: 8 May 2017 Donor status: individual (Registered 04 July 2017)", "Name of donor: Paul Brett Address of donor: private Amount of donation or nature and value if donation in kind: £2,000 Date received:  12 May 2017 Date accepted: 12 May 2017 Donor status: individual (Registered 04 July 2017)", "Name of donor: J C Bamford Excavators Ltd Address of donor: Rocester, Staffordshire ST14 5JP Amount of donation or nature and value if donation in kind: £3,000 Date received: 26 May 2017 Date accepted: 26 May 2017 Donor status: company, registration 00561597 (Registered 04 July 2017)"], "Miscellaneous": ["Proprietor of Egin Partnership, an economic consultancy. Address: Cynfal, Lon Ddewi, Caernarfon, Gwynedd, LL55 1BH. No payments received. (Updated 9 June 2014)"], "Family members employed and paid from parliamentary expenses": ["I employ my spouse, Esyllt Penri, to provide translation services as part time Office Manager/Personal Assistant. (Registered 27 January 2017)"]}}, "Margaret Beckett": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Unite the Union Address of donor: 128 Theobalds Road, Holborn, London WC1X 8TN Amount of donation or nature and value if donation in kind: £2,000 Donor status: trade union (Registered 07 July 2017)", "Name of donor: UNISON Address of donor: 130 Euston Road, London NW1 2AY Amount of donation or nature and value if donation in kind: £3,000 Donor status: trade union (Registered 07 July 2017)", "Name of donor: UNISON - East Midlands Address of donor: Vivian Avenue, Nottingham NG5 1AF Amount of donation or nature and value if donation in kind: £2,000 Donor status: trade union (Registered 07 July 2017)"], "Family members employed and paid from parliamentary expenses": ["I employ my husband, Leo Beckett, as Office Manager."]}}, "Órfhlaith Begley": {"2018-06-04": {}}, "Henry Bellingham": {"2018-06-04": {"Employment and earnings": ["Non-executive director of Developing Markets Associates Ltd, 150 Tooley Street, London SE1 2TU, a global consultancy and investment conference organiser. From October 2015 until further notice I receive £2,500 a month for a commitment of approx. 3.5 hrs. (Registered 17 May 2013; updated 27 November 2015)", "Non-executive Chairman of Pathfinder Minerals PLC, Becket House, 36 Old Jewry, London EC2R 8DD, an AIM listed mining company. For carrying out duties as Non-Executive Chairman and giving advice on strategy and corporate governance, I receive £4,000 per month until further notice. Hours:  4-7 hrs per month. (Registered 17 February 2014; updated 17 July 2015)", "From 1 January 2016, Senior Adviser to J. Stern & Co. LLP, 21 Knightsbridge, London SW1X 7LY, a fund management company. Until further notice, I will receive a monthly payment of £2,500 for providing legal advice, and advice on corporate governance and strategic direction. Hours: approx. 4.5 hrs per month. Initial payment of £5,000 received on 1 January 2016. (Registered 09 February 2016)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Gross-Hill Proerties Ltd Address of donor: 235 Old Marylebone Road, London NW1 5QT Amount of donation or nature and value if donation in kind: £1,499 for my general election campaign Donor status: company, registration 01762000 (Registered 03 July 2017)", "Name of donor: Gross-Hill Proerties Ltd Address of donor: 235 Old Marylebone Road, London NW1 5QT Amount of donation or nature and value if donation in kind: £4,999 for my general election campaign Donor status: company, registration 01762000 (Registered 03 July 2017)", "Name of donor: David Flux Address of donor: private Amount of donation or nature and value if donation in kind: £5,000 for my general election campaign Donor status: individual (Registered 03 July 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Forestry and arable land in Norfolk: (i)."], "(i) Shareholdings: over 15% of issued share capital": ["Lansdowne Advisory Ltd.", "Longborough Capital PLC", "Glencara Estate Company (Registered 28 May 2013)"], "Miscellaneous": ["Non-practising barrister-at-law.", "Non-Executive Chairman of Pontus Marine Limited, a UK based company with commercial fishing interests in the Gulf of Aden and the Middle East.  I carry out duties as Non-Executive Chairman and give advice on strategy and corporate governance. Since November 2015, I receive no remuneration for this role. (Registered 12 June 2013; updated 17 July 2015 and 27 November 2015)", "Unremunerated director of Global Law Summit Ltd, which was set up to run the 2015 Global Law Summit commemorating 800th anniversary of the Magna Carta and to promote UK legal services around the world. It is also looking at organising another law Summit in the future. (Registered 31 October 2013; updated 07 June 2016)"], "Family members employed and paid from parliamentary expenses": ["I employ my wife, Emma Bellingham, as temporary part-time Parliamentary Assistant/Researcher."]}}, "Hilary Benn": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: GMB Yorkshire Region and National Address of donor: 22 Stephenson Way, London NW1 2HD Amount of donation or nature and value if donation in kind: £2,000 Donor status: trade union (Registered 06 July 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Part-owner of house and small nature reserve in Essex: (i). (Updated 24 November 2014)"], "Family members employed and paid from parliamentary expenses": ["I employ my wife, Sally Clark, as part-time Research/Parliamentary Assistant."]}}, "Richard Benyon": {"2018-06-04": {"Employment and earnings": ["From 15 October 2015, director and Chair of the UK Water Partnership, a not for profit company set up to promote the interests of the UK water sector. Until further notice, I will be paid £15,000 a year (£3,750 quarterly)  for an expected annual commitment of 12-14 days. (Registered 28 October 2015)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Sir Christopher Gent Address of donor: private Amount of donation or nature and value if donation in kind: £2,000 in support of my re-election campaign Donor status: individual (Registered 30 June 2017)", "Name of donor: Lord Robert Iliffe Address of donor: private Amount of donation or nature and value if donation in kind: £2,500 in support of my re-election campaign Donor status: individual (Registered 06 July 2017)", "Name of donor: Sir Philip Wroughton Address of donor: private Amount of donation, or nature and value if donation in kind: £3,000 Donor status: individual (Registered 04 January 2018)", "Name of donor: Sir Philip Wroughton Address of donor: private Amount of donation, or nature and value if donation in kind: £1,000 Donor status: individual (Registered 09 January 2018)", "Name of donor: Sir Christopher Gent Address of donor: private Amount of donation, or nature and value if donation in kind: £1,250 Donor status: individual (Registered 09 January 2018)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Landholdings in Hampshire and Berkshire (some in my constituency) comprising farmland, residential and commercial property, some potential development land, woodlands and gravel workings, for some of which rent is received: (i) and (ii) Residential and commercial property in Hackney, for which rent is received: (i) and (ii) Rural land and property in Inverness-shire: (i) \n The majority of property in these estates is held in family trusts in the trusteeship of Englefield Estate Trust Corporation Limited, of which I am Director. This is the trustee of various family trusts in all of which either I or members of my wider family have beneficial interests. (Updated 9 January 2014)"], "Family members employed and paid from parliamentary expenses": ["I employ my sister, Catherine Haig, as part time Senior Researcher. (Registered 26 January 2017)"]}}, "John Bercow": {"2018-06-04": {"Gifts, benefits and hospitality from UK sources": ["Name of donor: The Queens Club Address of donor: Palliser Road, London W14 9EQ Amount of donation or nature and value if donation in kind: two tickets to attend the Aegon Championships, with associated hospitality; value £630 Date received:  25 June 2017 Date accepted: 25 June 2017 Donor status: company, registration 23072 (Registered 05 July 2017)", "Name of donor: All England Lawn Tennis Club, Church Road, Wimbledon, London SW19 5AE Amount of donation or nature and value if donation in kind: two tickets for the Royal Box at the Wimbledon championships on 13 July 2017, estimated value £8,590 Date received: 13 July 2017 Date accepted: 13 July 2017 Donor status: company, registration 07546773 (Registered 17 July 2017)", "Name of donor: Lancashire County Cricket Club Address of donor: Emirates Old Trafford, Manchester M16 0PX Amount of donation, or nature and value if donation in kind: Ticket to attend the Test Match on 5 August 2017, and associated hospitality, total value £420 Date received: 5 August 2017 Date accepted: 5 August 2017 Donor status: company, registration IP28451R. (Registered 24 August 2017)", "Name of donor: Frank Warren Address of donor: private Amount of donation, or nature and value if donation in kind: Two tickets for a football match on 9 September 2017, with associated hospitality; total value £330 Date received: 9 September 2017 Date accepted: 9 September 2017 Donor status: individual. (Registered 28 September 2017)", "Name of donor: Frank Warren Address of donor: private Amount of donation, or nature and value if donation in kind: Two tickets for a football match on 14 September 2017, with associated hospitality; total value £330 Date received: 14 September 2017 Date accepted: 14 September 2017 Donor status: individual. (Registered 28 September 2017)", "Name of donor: Frank Warren Address of donor: private Amount of donation, or nature and value if donation in kind: Two tickets for a boxing match on 16 September 2017, with associated hospitality; total value £400 Date received: 16 September 2017 Date accepted: 16 September 2017 Donor status: individual. (Registered 28 September 2017)", "Name of donor: Norwich City Football Club Address of donor: Carrow Road, Norwich NR 1JE Amount of donation or nature and value if donation in kind: two tickets to attend a football match on 14 October 2017, and associated hospitality; total value £511.63 Date received: 14 October 2017 Date accepted: 14 October 2017 Donor status: company, registration 00154044. (Registered 23 October 2017)", "Name of donor: Manchester City Football Club Address of donor: Etihad Stadium, Etihad Campus, Manchester M11 3FF Amount of donation or nature and value if donation in kind: two tickets to attend a football match on 5 November 2017, and associated hospitality; total value £2,400 Date received: 5 November 2017 Date accepted: 5 November 2017 Donor status: company, registration 40946 (Registered 28 November 2017)", "Name of donor: Association of Tennis Professionals Address of donor: Palliser House, Palliser Road, London W14 9EB Amount of donation or nature and value if donation in kind: four tickets to attend the ATP World Tour Finals on Sunday 12 November 2017, and associated hospitality; total value £426.40 Date received: 12 November 2017 Date accepted: 12 November 2017 Donor status: unincorporated association (Registered 28 November 2017)", "Name of donor: Association of Tennis Professionals Address of donor: Palliser House, Palliser Road, London W14 9EB Amount of donation or nature and value if donation in kind: two tickets to attend the ATP World Tour Finals on Tuesday 14 November 2017, and associated hospitality; total value £286.40 Date received: 14 November 2017 Date accepted: 14 November 2017 Donor status: unincorporated association (Registered 28 November 2017)", "Name of donor: Association of Tennis Professionals Address of donor: Palliser House, Palliser Road, London W14 9EB Amount of donation or nature and value if donation in kind: two tickets to attend the ATP World Tour Finals on Thursday 16 November 2017, and associated hospitality; total value £286.40 Date received: 16 November 2017 Date accepted: 16 November 2017 Donor status: unincorporated association (Registered 28 November 2017)", "Name of donor: Lawn Tennis Association Address of donor: 100 Priory Lane, London SW15 5JQ Amount of donation or nature and value if donation in kind: two tickets to attend the ATP World Tour Finals on Sunday 19 November 2017, and associated hospitality; total value £480 Date received: 19 November 2017 Date accepted: 19 November 2017 Donor status: company, registration 07459469 (Registered 30 November 2017)", "Name of donor: Arsenal Football Club Address of donor: Highbury House, 75 Drayton Park, London N5 1BU Amount of donation or nature and value if donation in kind: two tickets to attend a football match on 29 November 2017, and associated hospitality; total estimated value £500 Date received: 29 November 2017 Date accepted: 29 November 2017 Donor status: company, registration 00109244 (Registered 20 December 2017)", "Name of donor: Arsenal Football Club Address of donor: Highbury House, 75 Drayton Park, London N5 1BU Amount of donation or nature and value if donation in kind: two tickets to attend a football match on 10 December 2017, and associated hospitality; total estimated value £500 Date received: 10 December 2017 Date accepted: 10 December 2017 Donor status: company, registration 00109244 (Registered 20 December 2017)", "Name of donor: Frank Warren Address of donor: private Amount of donation, or nature and value if donation in kind: Two tickets for a football match on 1 March 2018, with associated hospitality; total value £330 Date received: 1 March 2018 Date accepted: 1 March 2018 Donor status: individual (Registered 06 March 2018)", "Name of donor: Brighton and Hove Albion Football Club Address of donor: American Express Community Stadium, Village Way, Falmer BN1 9BL Amount of donation, or nature and value if donation in kind: Two tickets to attend a football match, and associated hospitality; total value £528 Date received: 4 March 2018 Date accepted: 4 March 2018 Donor status: company, registration 81077 (Registered 13 March 2018)", "Name of donor: Frank Warren Address of donor: private Amount of donation, or nature and value if donation in kind: Two tickets for a football match on 5 April 2018, with associated hospitality; total value £330 Date received: 5 April 2018 Date accepted: 5 April 2018 Donor status: individual (Registered 12 April 2018)", "Name of donor: Frank Warren Address of donor: private Amount of donation, or nature and value if donation in kind: Two tickets for a football match on 8 April 2018, with associated hospitality; total value £330 Date received: 8 April 2018 Date accepted: 8 April 2018 Donor status: individual (Registered 12 April 2018)", "Name of donor: Frank Warren Address of donor: private Amount of donation, or nature and value if donation in kind: Two tickets for a football match on 22 April 2018, with associated hospitality; total value £330 Date received: 22 April 2018 Date accepted: 22 April 2018 Donor status: individual (Registered 24 April 2018)", "Name of donor: Ravi Gill Address of donor: private Amount of donation, or nature and value if donation in kind: Two tickets for a football match on 29 April 2018, with associated hospitality; total value £810 Date received: 29 April 2018 Date accepted: 29 April 2018 Donor status: individual (Registered 09 May 2018)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["House in London, owned jointly with my wife: (i) and (ii). (Registered 5 April 2013; updated 12 August 2013)"]}}, "Paul Beresford": {"2018-06-04": {"Employment and earnings": ["Employed as part-time dental surgeon for Beresford Dental Practice Limited, 207 Upper Richmond Road, SW15 6SQ. From 22 August 2017 until further notice I will receive drawings of £500 a month for an expected commitment of up to 300 hours a year. (Updated 22 February 2016 and 22 August 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Private accommodation and surgery, London: (i)."], "Family members employed and paid from parliamentary expenses": ["I employ my wife, Julie Beresford, as part-time Secretary/Diary Secretary."]}}, "Luciana Berger": {"2018-06-04": {"(b) Any other support not included in Category 2(a)": ["Name of donor: USDAW Address of donor: Ground Floor, Congress House, Great Russell Street, London WC1B 3LS Amount of donation or nature and value if donation in kind: £3,000 towards my election campaign Date received: 2 May 2017 Date accepted: 2 May 2017 Donor status: trade union (Registered 04 July 2017)", "Name of donor: The Musicians' Union Address of donor: 60-62 Clapham Road, London SW9 0JJ Amount of donation or nature and value if donation in kind: £2,000 towards my election campaign Date received: 4 May 2017 Date accepted: 4 May 2017 Donor status: trade union (Registered 04 July 2017)"]}}, "Jake Berry": {"2018-06-04": {"Employment and earnings": ["Until 15 June 2017, consultant to Squire Patton Boggs (UK) LLP (formerly Squire, Sanders and Dempsey (UK) LLP) as a consultant solicitor advising on client services, business development and on other specific matters. Address: Trinity Court, 16 John Dalton Street, Manchester M60 8HS. From September 2016, I was paid £2,500 per month. (Updated 11 June 2014, 20 July 2015, 01 November 2016 and 21 June 2017)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: The Portcullis Club Address of donor: Whins House, Sabden, Clitheroe, Lancashire BB7 9HP Amount of donation, or nature and value if donation in kind: £10,000 Donor status: unincorporated association (Registered 10 July 2017)"], "(b) Any other support not included in Category 2(a)": ["Name of donor: Alan Torevell Address of donor: private Amount of donation or nature and value if donation in kind: £3,000 Date received: 19 May 2017 Date accepted: 19 May 2017 Donor status: individual (Registered 05 July 2017; updated 04 January 2018)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["A share of commercial property in Liverpool: (i). (Updated 12 January 2015)", "A share of a flat in Liverpool: (i) and (ii).", "A share of a house in Rhoscolyn, North Wales: (i) and from April 2017, (ii). (Updated 11 April 2017)", "A house in Rhoscolyn, North Wales: (i) and (ii).", "From April 2017, a share of a third house in Rhoscolyn, North Wales: (i) and (ii). (Registered 11 April 2017)"]}}, "Clive Betts": {"2018-06-04": {"Employment and earnings": ["Payments from ComRes, Four Millbank, London SW1P 3JA, for opinion surveys. All fees are paid direct to my constituency party:", "28 February 2017, payment of £100. Hours: 30 mins. (Registered 24 October 2017)", "11 April 2017, payment of £50. Hours: 20 mins. (Registered 24 October 2017)", "30 May 2017, payment of £75. Hours: 30 mins. (Registered 24 October 2017)", "30 August 2017, payment of £75. Hours: 30 mins. (Registered 24 October 2017)", "22 September 2017, payment of £75. Hours: 30 mins. (Registered 24 October 2017)", "5 October 2017, payment of £150. Hours: 40 mins. (Registered 01 March 2018)", "16 November 2017, payment of £75. Hours: 30 mins. (Registered 01 March 2018)", "3 September 2017, received £200 from Ipsos MORI, 3 Thomas More Square, London E1W 1YW, for an opinion survey. Hours: 45 mins. (Registered 24 October 2017)", "Payments from YouGov, 50 Featherstone Street, London EC1Y 8RT, for opinion surveys. All fees are paid direct to my constituency party:", "8 February 2017, payment of £20. Hours: 15 mins. (Registered 01 March 2018)", "21 March 2017, payment of £80. Hours: 30 mins. (Registered 01 March 2018)", "25 April 2017, payment of £20. Hours: 15 mins. (Registered 01 March 2018)", "26 July 2017, payment of £80. Hours: 30 mins. (Registered 01 March 2018)", "2 October 2017, payment of £40. Hours: 15 mins. (Registered 01 March 2018)", "26 October 2017, payment of £40. Hours: 15 mins. (Registered 01 March 2018)", "14 November 2017, payment of £100. Hours: 30 mins. (Registered 01 March 2018)", "14 November 2017, payment of £100. Hours: 30 mins. (Registered 01 March 2018)", "8 December 2017, payment of £60. Hours: 30 mins. (Registered 01 March 2018)", "20 December 2017, payment of £30. Hours: 15 mins. (Registered 01 March 2018)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["One residential property in London: (i) and (ii)."], "Family members employed and paid from parliamentary expenses": ["I employ my partner, James Thomas, as Senior Parliamentary Assistant."]}}, "Mhairi Black": {"2018-06-04": {"Employment and earnings": ["From 3 October 2015, weekly newspaper column for The National, Newsquest Media (Herald & Times) Ltd, 200 Renfield St, Glasgow G2 3QB, for which I receive £150 per week until further notice. Hours: approx. 3 hrs per week. Payments are made direct to charity. First payment of £900 received on 1 December 2015. (Registered 18 December 2015; updated 5 January 2016)"]}}, "Ian Blackford": {"2018-06-04": {"Employment and earnings": ["From 1 December 2015, Chairman of Golden Charter Trust Ltd, Canniesburn Gate, 10 Canniesburn Drive, Bearsden, Glasgow G61 1BF. From April 2018 until further notice, I will be paid £3,091 per month (previously £3,000). Hours: 8 hrs per quarter. In addition, I will be paid £1,500 per day for any additional work (additional payments will be listed below). (Registered 3 June 2015; updated 14 December 2015, 6 June 2016 and 12 April 2018)", "Chairman of Commsworld Plc, Commsworld House, Peffer Place, Edinburgh EH16 4BB. Paid £1,000 a month, from 31 July 2015 until further notice. Hours: 8 hrs per quarter. (Registered 3 June 2015; updated 3 August 2015)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: David Craigen Address of donor: private Amount of donation or nature and value if donation in kind: £3,000 Donor status: individual (Registered 14 June 2017; updated 08 August 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: Energy Law Unlimited LLP Address of donor: 231 St Vincent Street, Glasgow G2 5QY Amount of donation, or nature and value if donation in kind: Tickets and hospitality for myself and my wife at the Scotland v England rugby international at Murrayfield, total value £1,360.80 Date received: 24 February 2018 Date accepted: 24 February 2018 Donor status: company, registration SO304467 (Registered 20 March 2018)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Until 18 October 2017, a house in Lanark: (i). (Registered 3 June 2016; updated 18 October 2017)", "From 4 November 2016, a house on the Isle of Skye: (i). (Registered 08 November 2016)"], "(i) Shareholdings: over 15% of issued share capital": ["First Seer Ltd (see category 8 below). (Registered 02 December 2016)"], "(ii) Other shareholdings, valued at more than £70,000": ["Commsworld; telecoms company. (Registered 03 June 2015)"], "Miscellaneous": ["Director (unpaid) of First Seer Ltd, 12A Chester Street, Edinburgh EH3 7RA. First Seer owns our croft business and ancillary activities. (Registered 3 June 2015; updated 17 November 2015)", "Investment portfolio managed on a discretionary basis by Brooks MacDonald Plc. (Registered 03 June 2015)", "From 27 March 2017 until 16 June 2017, non-executive director (unpaid) of New City Agenda; a not-for-profit think tank aiming to develop ideas and research on financial services policy. (Registered 27 March 2017; updated 19 June 2017)"], "Family members employed and paid from parliamentary expenses": ["I employ my step-son, John O'Leary, as Senior Caseworker from 1 June 2017. (Registered 3 June 2015; updated 13 June 2017)"]}}, "Roberta Blackman-Woods": {"2018-06-04": {"Employment and earnings": ["6 November 2017, received £200 from Research Ltd, Unit 111, 134-146 Curtain Road, London EC2A 3AR, for an article in Research Fortnight Higher Education. Hours: 2 hrs. (Registered 15 November 2017)"], "Visits outside the UK": ["Name of donor: RESULTS UK Address of donor: 31-33 Bondway, London SW8 1SJ Estimate of the probable value (or amount of any donation): Flights £802.43; accommodation £593.60; transport £262; food/drinks £114; total £1,772.03 Destination of visit: Tanzania Dates of visit: 17 - 23 September 2017 Purpose of visit: To visit DIFD supported projects in Tanzania. (Registered 10 October 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["From October 2016, a flat in central London: (i) and (ii). (Registered 26 October 2016)"]}}, "Bob Blackman": {"2018-06-04": {"Employment and earnings": ["Payments from ComRes, 4 Millbank, London, SW1P 3JA, for opinion surveys:", "23 February 2017, payment of £100. Hours: 1 hr. (Registered 21 September 2017)", "12 June 2017, payment of £75. Hours: 45 mins. (Registered 21 September 2017)", "10 July 2017, payment of £50. Hours: 30 mins. (Registered 21 September 2017)", "14 September 2017, payment of £150. Hours: 90 mins. (Registered 21 September 2017)", "16 October 2017, received £75. Hours: 1 hr. (Registered 14 November 2017)", "17 November 2017, received £75. Hours: 1 hr. (Registered 23 November 2017)", "Payments from YouGov, 50 Featherstone Street, London EC17 8RT, for opinion surveys:", "14 February 2017, received £20. Hours: 10 mins. (Registered 14 November 2017)", "22 March 2017, received £80. Hours: 30 mins. (Registered 14 November 2017)", "5 April 2017, received £25. Hours: 10 mins. (Registered 14 November 2017)", "28 May 2017, received £60. Hours: 30 mins. (Registered 14 November 2017)", "26 July 2017, received £30. Hours: 20 mins. (Registered 14 November 2017)", "7 November 2017, received £40. Hours: 20 mins. (Registered 14 November 2017)", "8 November 2017, received £30. Hours: 30 mins. (Registered 14 November 2017)", "17 November 2017, received £70. Hours: 1 hr. (Registered 23 November 2017)", "20 December 2017, received £60. Hours: 1 hr. (Registered 12 January 2018)", "Payments from Ipsos MORI, 3 Thomas More Square, London E1W 1YW, for opinion surveys:", "25 January 2017, payment of £200. Hours: 1 hr. (Registered 08 August 2017)", "1 August 2017, payment of £200. Hours: 1 hr. (Registered 08 August 2017)", "16 January 2018, payment of £200. Hours: 1.5 hrs. (Registered 19 January 2018)", "Payments from Populus, Northburgh House, 10 Northburgh Street, London EC1V 0AT, for opinion surveys:", "12 January 2017, payment of £50. Hours: 30 mins. (Registered 06 July 2017)", "16 February 2017, payment of £50. Hours: 30 mins. (Registered 06 July 2017)", "27 February 2017, payment of £50. Hours: 30 mins. (Registered 06 July 2017)", "3 April 2017, payment of £50. Hours: 30 mins. (Registered 06 July 2017)", "24 April 2017, payment of £50. Hours: 30 mins. (Registered 06 July 2017)", "29 June 2017, payment of £75. Hours: 45 mins. (Registered 06 July 2017)", "15 September 2017, payment of £50. Hours: 30 mins. (Registered 21 September 2017)", "12 September 2017, payment of £50. Hours: 30 mins. (Registered 27 September 2017)", "7 December 2017, payment of £50. Hours: 30 mins. (Registered 13 December 2017)", "28 November 2017, payment of £50. Hours: 30 mins. (Registered 21 December 2017)"], "Visits outside the UK": ["Name of donor: Welle Association for Human Rights and Freedom Address of donor: Verein Welle, Postfach 1764, 8048 Zürich Estimate of the probable value (or amount of any donation): Eurostar costs and joint accommodation, for myself and a staff member, with an approx. value of £435 Destination of visit: Paris, France Dates of visit: 30 June - 2 July 2017 Purpose of visit: To attend the annual Free Iran Rally organized by the National Council of Resistance of Iran (NCRI) in my role as a supportive British MP. (Registered 02 August 2017)", "Name of donor: Ministry of Foreign Affairs, Republic of China (Taiwan) Address of donor: c/o Taipei Representative Office in the UK, 50 Grosvenor Gardens, London SW1W 0EB Estimate of the probable value (or amount of any donation): flights, internal travel, accommodation and hospitality; approx. value £5,000 Destination of visit: Taipei Dates of visit: 16 – 23 September 2017 Purpose of visit: Taiwan APPG delegation at the invitation of the Government of the Republic of China (Taiwan) to gain a better understanding of economic and political issues concerning the country. (Registered 11 October 2017)", "Name of donor: The International Siddhashram Shakti Centre (ISSC) India Address of donor: Vaghaldhara, Ta and Dist: Valsad, Gujarat, 396375, India Estimate of the probable value (or amount of any donation): International and domestic transport, food and accommodation, for myself and one member of staff, with a total value of £11,300 Destination of visit: Ahmedabad and Delhi, India Dates of visit: 11-19 February 2018 Purpose of visit: To meet with political figures in India and attend a Delhi World Peace and Harmony Event with youth leaders. (Registered 28 February 2018)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Six buy-to-let properties in Welwyn Garden City owned jointly with my wife: (i) and (ii)."], "Family members employed and paid from parliamentary expenses": ["I employ my wife, Nicola Blackman, as Office Manager."]}}, "Kirsty Blackman": {"2018-06-04": {"Miscellaneous": ["From 5 September 2017, non-executive director (unpaid) of New City Agenda; a not-for-profit think tank aiming to develop ideas and research on financial services policy. (Registered 11 September 2017)"]}}, "Paul Blomfield": {"2018-06-04": {"Employment and earnings": ["Payments from Ipsos MORI, 3 Thomas More Square, London E1W 1YW:", "Payment of £200 expected for completing a survey on 16 August 2017. Hours: 1 hr. This fee will be paid direct to charity. (Registered 12 September 2017)", "Payment of £200 expected from ComRes, Coveham House, Downside Bridge Road, Cobham KT11 3EP, for a survey completed on 1 December 2017. Hours: 1 hr. This fee will be donated to charity. (Registered 13 December 2017)"]}}, "Crispin Blunt": {"2018-06-04": {"Employment and earnings": ["14 November 2017, £250 paid to an NGO by Slainte Media Ltd, 133 Finnieston Street, Glasgow G3 8HB. This was in respect of an interview recorded on 14 November 2017 and broadcast by Russia Today (RT UK), 16th Floor, Millbank Tower, 21-24 Millbank, London SW1P 4QP on 16 November 2017. Hours: 1 hr. (Registered 16 November 2017)", "Payments received from Ipsos Mori, 3 Thomas More Square, London E1W 1YW, for completing opinion surveys:", "14 September 2017, received £200 for survey completed on 14 July 2017. Hours: 1 hr. (Registered 19 December 2017)", "Payment of £200 expected for survey completed on 15 December 2017. Hours: 1 hr. (Registered 19 December 2017)", "From 22 March 2018 until further notice, I am retained by Wena Consult Ltd of Cranbrook House, 61 Cranbrook Road, Ilford IP1 4PG. I provide advice on UK exports to Middle Eastern markets. I received £20,000 on 22 March 2018 and I expect to receive £20,000 in arrears each March for a minimum of 80 hours’ work each year. (Registered 17 April 2018)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Nael Farargy Address of donor: private Amount of donation or nature and value if donation in kind: £10,000 for my fighting fund Donor status: individual (Registered 26 June 2017)", "Name of donor: Peter Harrison Address of donor: private Amount of donation or nature and value if donation in kind: £10,000 for my fighting fund Donor status: individual (Registered 26 June 2017)"], "(b) Any other support not included in Category 2(a)": ["Name of donor: Nael Farargy Address of donor: private Amount of donation, or nature and value if donation in kind: £20,000 to hire a part time member of staff and meet office and staff expenses. Date received: 3 November 2017 Date accepted: 3 November 2017 Donor status: individual (Registered 14 November 2017)"], "Visits outside the UK": ["Name of donor: Kurdistan Regional Government UK Representation Address of donor: 50 Broadway, London SW1H 0RG Estimate of the probable value (or amount of any donation): For myself and a member of staff, flights £2,054; accommodation £602; subsistence £110; total value £2,766 Destination of visit: Erbil, Kurdistan region of Iraq Dates of visit: 23-28 September 2017 (22-28 September 2017 for my member of staff) Purpose of visit: Observe the Independence Referendum in in the Kurdistan Regional of Iraq. (Registered 13 October 2017)", "Name of donor: Kingdom of Bahrain Ministry of Foreign Affairs Address of donor: P.O. Box 547, Government Road, Manama, Kingdom of Bahrain Estimate of the probable value (or amount of any donation): Flights, transport, food and accommodation with a value of £3,250 Destination of visit: Bahrain Dates of visit: 7-11 December 2017 Purpose of visit: Parliamentary delegation, with the Conservative Middle East Council, to the IISS Manama Dialogue 2017 in order to gain a deeper understanding of the strategic links between the Kingdom of Bahrain and the wider Gulf States and the UK. (Registered 13 December 2017)", "Name of donor: Lords and Commons Cricket Club Address of donor: House of Commons, London SW1A 0AA Amount of donation (or estimate of the probable value): £985 towards in country accommodation costs Destination of visit: Melbourne and Sydney, Australia Date of visit: 27 December 2017 – 6 January 2018 Purpose of visit: to participate in an inter-parliamentary cricket tournament and to raise funds for two local charities. (Registered 24 January 2018)", "Name of donor: (1) Privateer Holdings Inc  (2) Botanica Inc Address of donor: (1) 1920 Eastlake Ave E, Seattle, Washington State, USA  (2) 3300 1st Avenue S, #100, WA98134, Seattle, Washington State, USA Estimate of the probable value (or amount of any donation): (1) Hotel accommodation, subsistence, air fares, air and road transport provided to a total of £2,532  (2) £3,750 paid to me on 3 April 2018 for the travel and accommodation costs of two accompanying staff members, one of whom is employed by another Member of Parliament Destination of visit: Seattle, Washington State, USA Dates of visit: 9-15 April 2018 Purpose of visit: To understand the regulatory, licensing and economic issues around the cannabis industry in Washington State. (Registered 01 May 2018; updated 09 May 2018)"]}}, "Nicholas Boles": {"2018-06-04": {"Employment and earnings": ["4 May 2017, received £300 from The Times Newspaper News UK, 1 London Bridge Street, London SE1 9GF, for an article which appeared on 7 April 2017. Hours: 4 hrs. (Registered 06 July 2017)", "7 June 2017, received £550 from the The Times Newspaper News UK, 1 London Bridge Street, London SE1 9GF, for an article which appeared on 8 May 2017. Hours: 4 hrs. (Registered 06 July 2017)", "3 May 2018, received £900 from the Daily Mail, Associated Newspapers, 2 Derry Street, London W8 5TT, for an article which appeared on 27 December 2017. Hours: 4 hrs. (Registered 15 May 2018)", "From 24 May 2018 until 23 May 2020, Non-Executive Director of Totemic Ltd, Kempton House, Kempton Way, Dysart Road, Grantham NG31 7LE. I will receive £30,000 per annum for this role. Hours: 16 hrs per month. (Registered 30 May 2018)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Hindmarch Properties Ltd Address of donor: 3, Castlegate, Grantham NG31 6SF Amount of donation or nature and value if donation in kind: £2,000 Donor status: company, registration 72290 (Registered 06 July 2017)", "Name of donor: Grantham Investments Ltd Address of donor: 3, Castlegate, Grantham, NG31 6SF Amount of donation or nature and value if donation in kind: £2,000 Donor status: company, registration 804559 (Registered 06 July 2017)", "Name of donor: Springfield Park Properties Ltd Address of donor: 3, Castlegate, Grantham NG31 6SF Amount of donation or nature and value if donation in kind: £2,000 Donor status: company, registration 2880390 (Registered 06 July 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: The Essex Research Association Address of donor: c/o Munro Wright and Wasbrough LLP, 7-8 Great James Street, London WC1N 3DF Amount of donation or nature and value if donation in kind: £20,000 to support the research and writing of a forthcoming book Date received: 7 July 2017 Date accepted: 7 July 2017 Donor status: trust (Registered 24 July 2017)", "Name of donor: The Public Interest Foundation (UK charity) Address of donor: private Amount of donation, or nature and value if donation in kind: £5,000 to support the research and writing of a forthcoming book Date received: 20 August 2017 Date accepted: 20 August 2017 Donor status: other (Registered 13 September 2017)", "Name of donor: Sir Laurie Magnus Address of donor: private Amount of donation or nature and value if donation in kind: £3,000 to support the research and writing of a book Date received: 1 December 2017 Date accepted: 1 December 2017 Donor status: individual (Registered 06 December 2017)", "Name of donor: Lord John Nash Address of donor: private Amount of donation, or nature and value if donation in kind: £5,000 to support the research and writing of a book Date received: 18 January 2018 Date accepted: 18 January 2018 Donor status: individual (Registered 26 January 2018)", "Name of donor: Lord Dennis Stevenson CBE Address of donor: private Amount of donation, or nature and value if donation in kind: £1,500 to support the research and writing of a book Date received: 11 February 2018 Date accepted: 19 February 2018 Donor status: individual (Registered 26 February 2018)", "Name of donor: Lord Stanley Fink Address of donor: private Amount of donation, or nature and value if donation in kind: £10,000 to support the research and writing of a book Date received: 14 February 2018 Date accepted: 19 February 2018 Donor status: individual (Registered 26 February 2018)"]}}, "Peter Bone": {"2018-06-04": {"Employment and earnings": ["Fees for completing surveys for ComRes, 4 Millbank, London SW1P 3JA:", "Received £100 on 23 February 2017 for a survey completed on 21 November 2016. Hours: 1 hr. (Registered 22 September 2017)", "Received £75 on 12 June 2017 for a survey completed on 15 January 2017. Hours: 30 mins. (Registered 22 September 2017)", "Received £75 on 14 September 2017 for a survey completed on 7 March 2017. Hours: 30 mins. (Registered 22 September 2017)", "Received £75 on 14 September 2017 for a survey completed on 20 June 2017. Hours: 30 mins. (Registered 22 September 2017)", "Received £100 on 23 February 2017 for a survey completed on 21 November 2016. Hours: 1 hr. (Registered 14 December 2017)", "Received £75 on 11 June 2017 for a survey completed on 15 January 2017. Hours: 30 mins. (Registered 14 December 2017)", "Received £150 on 14 September 2017 for two surveys completed on 7 March and 20 June 2017. Hours: 1 hr in total. (Registered 14 December 2017)", "Received £150 on 8 October 2017 for two surveys completed on 8 July and 12 September 2017. Hours: 1 hr in total. (Registered 14 December 2017)", "Received £75 on 20 November 2017 for a survey completed on 15 October 2017. Hours: 30 mins. (Registered 14 December 2017)", "Received £100 on 5 January 2018 for a survey completed on 21 November 2017. Hours: 45 mins. (Registered 18 April 2018)", "Received £100 on 2 February 2018 for a survey completed on the 9 January 2018. Hours: 45 mins. (Registered 18 April 2018)", "Received £75 on 14 March 2018 for a survey completed on 22 February 2018. Hours: 30 mins. (Registered 18 April 2018)", "Received £75 on 18 April 2018 for a survey completed on 7 March 2018. Hours: 30 mins. (Registered 18 April 2018)", "Fees for completing surveys for IPSOS Mori, 3 Thomas More Square, London E1W 1YW:", "Received £200 on 21 August 2017 for a survey completed on 5 July 2017. Hours: 1 hr. (Registered 21 August 2017)", "Received £100 on 8 March 2017 for a survey completed on 14 December 2016. Hours: 30 mins. (Registered 14 December 2017)", "Received £200 on 4 December 2017 for a survey completed on 22 November 2017. Hours: 1 hr. (Registered 14 December 2017)", "Fees for completing surveys for YouGov, 50 Featherstone Street, London EC1Y 8RT:", "Received £20 on 14 February 2017 for a survey completed on 16 January 2017. Hours: 10 mins. (Registered 14 December 2017)", "Received £25 on 5 April 2017 for a survey completed on 8 March 2017. Hours: 10 mins. (Registered 14 December 2017)", "Received £80 on 22 March 2017 for a survey completed on 21 February 2017. Hours: 30 mins. (Registered 14 December 2017)", "Received £20 on 25 April 2017 for a survey completed on 23 March 2017. Hours: 10 mins. (Registered 14 December 2017)", "Received £30 on 26 July 2017 for a survey completed on 20 June 2017. Hours: 15 mins. (Registered 14 December 2017)", "Received £40 on 4 October 2017 for a survey completed on 14 September 2017. Hours: 10 mins. (Registered 14 December 2017)", "Received £40 on 7 November 2017 for a survey completed on 7 October 2017. Hours: 10 mins. (Registered 14 December 2017)", "Received £100 on 16 November 2017 for a survey completed on 28 August 2017. Hours: 10 mins. (Registered 14 December 2017)", "Received £100 on 17 November 2017 for a survey completed on 23 October 2017. Hours: 30 mins. (Registered 14 December 2017)", "Owner of PWB Accountants, 40 Chester Road, Wellingborough, Northants NN8 1NY. (Registered 15 April 2016)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Industrial Motors Ltd Address of donor: South Drive, Coleshill B46 1DF Amount of donation or nature and value if donation in kind: £4,000 to support my candidacy at the General Election Donor status: company, registration 1269717 (Registered 05 July 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: NFL UK Address of donor: NFL International, 30 Panton Street, London SW1Y 4AJ Amount of donation, or nature and value if donation in kind: One ticket with hospitality for NFL game at Wembley, with a total value of £479 Date received: 24 September 2017 Date accepted: 24 September 2017 Donor status: company, registration 02777555 (Registered 26 September 2017)"], "(i) Shareholdings: over 15% of issued share capital": ["AJWB Travel Ltd; travel company."], "Miscellaneous": ["Director of AJWB Travel Ltd; non-remunerated at present.", "From 16 December 2015, Director of Grassroots Out Ltd; Venture Court, 2 Debdale Road, Wellingborough, Northants, NN8 5AA, a not for profit company campaigning to get the United Kingdom out of the European Union. This role has been unpaid since April 2016. All previous fees and payments donated (net of tax) to Grassroots Out Ltd. (Registered 11 January 2016; updated 18 February 2016 and 15 April 2016, 27 April 2016 and 28 April 2017)"], "Family members employed and paid from parliamentary expenses": ["I employ my wife, Jeanette Bone, as Executive Secretary."]}}, "Peter Bottomley": {"2018-06-04": {"Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Flat in Worthing: (i). (Registered 04 June 2015)", "Cottage in Waverley: (i). (Registered 04 June 2015)", "House in Westminster: (i). (Registered 04 June 2015)"], "(ii) Other shareholdings, valued at more than £70,000": ["Streetbook Ltd; an internet community communications company. (Updated 4 June 2015)"]}}, "Andrew Bowie": {"2018-06-04": {"Employment and earnings": ["30 June 2017, received £964.71 from Scottish Parliament, Royal Mile, Edinbugh EH9U 1SP, for my annual leave entitlement for my previous position. Hours: no hours since my election. (Registered 04 July 2017)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Emma Gigi Salomon Address of donor: private Amount of donation or nature and value if donation in kind: £7,500 Donor status: individual (Registered 29 June 2017)", "Name of donor: Stalbury Trustees Address of donor: 31 Hill Street, London W1J 4LS Amount of donation or nature and value if donation in kind: £5,000 Donor status: company, registration 1430799 (Registered 04 July 2017)"], "Visits outside the UK": ["Name of donor: International Republican Institute (Europe) Address of donor: Tivoligasse 73, 1120 Vienna, Austria Estimate of the probable value (or amount of any donation): Travel and accommodation worth approximately £450 Destination of visit: Paris Dates of visit: 18 - 19 January 2018 Purpose of visit: To discuss from a British perspective the response to populism and the changing political landscape in the West. (Registered 14 February 2018)", "Name of donor: (1) Conservative Friends of Israel Ltd (2) Israeli Ministry of Foreign Affairs Address of donor: (1) PO Box 72288, London SW1P 9LB (2) 9 Yitzhak Rabin Blvd., Kiryat Ben-Gurion, Jerusalem 9103001 Estimate of the probable value (or amount of any donation): (1) Travel, accommodation and hospitality with an approx. value of £2,650 (2) Bus travel and airport VIP service with a value of £650 Destination of visit: Israel and the West Bank Dates of visit: 11-16 February 2018 Purpose of visit: Fact finding political delegation. (Registered 28 February 2018)"]}}, "Tracy Brabin": {"2018-06-04": {"Employment and earnings": ["Payments received via The Agency, 24 Pottery Lane, London W11 4LZ:", "19 May 2017, received £250.29 from the BBC, Broadcasting House, Portland Place, London W1A 1AA, via the Writers Guild of Great Britain (Digital Payments), 1st Floor, 134 Tooley Street, London SE1 2TU, for online distribution. Hours: none since my election. (Registered 27 June 2017)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Unite the Union Address of donor: 128 Theobalds Road, London WC1X 8TN Amount of donation or nature and value if donation in kind: £4,000 Donor status: trade union (Registered 07 July 2017)", "Name of donor: Peter Hearn Address of donor: private Amount of donation, or nature and value if donation in kind: £2,000 Donor status: individual (Registered 07 July 2017)", "Name of donor: GMB Address of donor: St James Business Park, 81 Linwood Road, Paisley PA3 3BB Amount of donation or nature and value if donation in kind: £13,659.20 for a mail out/newsletter Donor status: trade union (Registered 18 July 2017)", "Name of donor: Al-Murad DIY Ltd Address of donor: Howley Park Road East, Morley, Leeds LS27 0BN Amount of donation, or nature and value if donation in kind: £1,990 to meet the costs of a fundraising event Donor status: company, registration 02635068 (Registered 06 November 2017)", "Name of donor: High Grove Beds Ltd Address of donor: Headlands Road, Liversedge, West Yorkshire WF15 6QA Amount of donation, or nature and value if donation in kind: £3,000 to meet the costs of a fundraising event Donor status: company, registration 04531825 (Registered 06 November 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: Unite the Union Address of donor: 128 Theobalds Road, London WC1X 8TN Amount of donation, or nature and value if donation in kind: Hotel accommodation during the Labour Party Conference with a value of £1,380 Date received: 23 - 27 September 2017 Date accepted: 23 September 2017 Donor status: trade union (Registered 21 December 2017)", "Name of donor: ITV plc Address of donor: The London Television Centre, Upper Ground, London SE1 9LT Amount of donation, or nature and value if donation in kind: Attendance at the National Television Awards, estimated value £1,075 (ticket £949 and hospitality £127) Date received: 23 January 2018 Date accepted: 23 January 2018 Donor status: company, registration 4967001 (Registered 16 February 2018)"], "Visits outside the UK": ["Name of donor: Medical Aid for Palestinians Address of donor: 33a Islington Park Street, London N1 1QB Estimate of the probable value (or amount of any donation): Flights, accommodation, food and transport with a total value of £1,053 Destination of visit: West Bank and Israel Dates of visit: 28 August- 1 September 2017 Purpose of visit: Fact finding visit organised by the Council for Arab-British Understanding and Medical Aid for Palestinians. (Registered 27 September 2017)"]}}, "Ben Bradley": {"2018-06-04": {"Employment and earnings": ["Allowances from Nottinghamshire County Council, West Bridgford, Nottingham NG2 7QP, for my role as Councillor:", "27 June 2017, received £1,397.93. This includes an additional responsibility allowance. Hours: none since the General Election. (Registered 10 July 2017)", "From 25 July 2017 until 27 March 2018, I received £879.33 a month for a commitment of approximately 10 hours a week. Payment was passed to local community groups. (Registered 10 July 2017; updated 27 March 2018)", "Until 31 August 2017, Councillor, Ashfield District Council, Urban Road, Kirkby in Ashfield NG17 8DA. (Registered 10 July 2017; updated 12 September 2017)", "15 June 2017, received £503.46. This includes an additional responsibility allowance. Hours: none since the General Election. (Registered 10 July 2017)", "From 15 July until 31 August 2017, I received £420 a month for a commitment of approximately five hours a week. Payment was passed to local community groups. (Registered 10 July 2017; updated 12 September 2017)", "30 June 2017, received £175.79 from the Independent Parliamentary Standards Authority, 4th Floor, 30 Millbank London SW1P 4DU, for my work as Senior Parliamentary Assistant for Nick Boles MP. I resigned on 8 June. Hours: none since the General Election. (Registered 10 July 2017)", "30 June 2017, received £707.64 from the Independent Parliamentary Standards Authority, 4th Floor, 30 Millbank London SW1P 4DU, for my work as Office Manager for Mark Spencer MP. I resigned on 8 June. Hours: none since the General Election. (Registered 10 July 2017)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Mr Jeremy Hosking Address of donor: private Amount of donation, or nature and value if donation in kind: £5,000 Donor status: individual (Registered 10 July 2017)", "Name of donor: David J. Wall Address of donor: private Amount of donation, or nature and value if donation in kind: £2,500 towards the delivery of leaflets Donor status: individual (Registered 15 February 2018)", "Name of donor: The Cayzer Trust Company Ltd Address of donor: Cayzer House, 30 Buckingham Gate, London SW1E 6NN Amount of donation, or nature and value if donation in kind: £5,000 Donor status: company, registration 4987694 (Registered 21 February 2018)", "Name of donor: The Carlton Club Address of donor: 69 St James’ Street, London SW1A 1PJ Amount of donation, or nature and value if donation in kind: £2,000 Donor status: members' association (unincorporated) (Registered 22 February 2018)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: David Brownlow Address of donor: private Amount of donation, or nature and value if donation in kind: £5,000 to help with legal costs Date received: 29 March 2018 Date accepted: 29 March 2018 Donor status: individual (Registered 25 May 2018)", "Name of donor: Mick Davis Address of donor: private Amount of donation, or nature and value if donation in kind: £10,000 to help with legal costs Date received: 29 March 2018 Date accepted: 29 March 2018 Donor status: individual (Registered 25 May 2018)"], "Miscellaneous": ["From 8 January 2018, Vice Chairman of the Conservative Party. This post carries a part time salary. (Registered 30 January 2018)", "Councillor, Nottinghamshire County Council. From 1 April 2018, I receive no allowances for this role. (Registered 27 March 2018)"]}}, "Karen Bradley": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Biddulph Conservative and Unionist Club Address of donor: 52 High Street, Biddulph ST8 5AJ Amount of donation, or nature and value if donation in kind: £5,000 Donor status: members' association (Registered 07 July 2017)", "Name of donor: Dominic Johnson Address of donor: private Amount of donation, or nature and value if donation in kind: Venue hire for a fundraising dinner, with a value of £3,993.85 Donor status: individual (Registered 10 April 2018)", "Name of donor: Reel Cinemas Ltd Address of donor: Sital House, Cattle Market, Loughborough LE11 3DL Amount of donation, or nature and value if donation in kind: £3,000 Donor status: company, registration 03561597 (Registered 10 April 2018)", "Name of donor: Reel Cinemas Ltd Address of donor: Sital House, Cattle Market, Loughborough LE11 3DL Amount of donation, or nature and value if donation in kind: £1,920 in purchasing tickets for a fundraising dinner Donor status: company, registration 03561597 (Registered 10 April 2018)", "Name of donor: Alexander Temerko Address of donor: private Amount of donation, or nature and value if donation in kind: £4,500 Donor status: individual (Registered 10 April 2018)", "Name of donor: Alexander Temerko Address of donor: private Amount of donation, or nature and value if donation in kind: £520 in purchasing tickets for a fundraising dinner Donor status: individual (Registered 10 April 2018)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: The Football League Ltd (trading as English Football League) Address of donor: EFL House, 10-12 West Cliff, Preston PR1 8HU Amount of donation, or nature and value if donation in kind: Three tickets plus hospitality for the Carabao Cup Final, Wembley, with a total value of £486 Date received: 25 February 2018 Date accepted: 25 February 2018 Donor status: company, registration 80612 (Registered 02 March 2018)", "Name of donor: Arsenal Football Club Address of donor: Highbury House, 75 Drayton Park, London N5 1BU Amount of donation, or nature and value if donation in kind: Three tickets plus hospitality for an Arsenal match, with a total value of £600 Date received: 1 March 2018 Date accepted: 1 March 2018 Donor status: company, registration 00109244 (Registered 13 March 2018)", "Name of donor: Albion Football Club (BOT) Ltd Address of donor: Pirelli Stadium, Princess Way, Burton on Trent DE13 0AR Amount of donation, or nature and value if donation in kind: Four tickets plus hospitality for a Burton Albion match, with a total value of £360 Date received: 10 March 2018 Date accepted: 10 March 2018 Donor status: company, registration 488096 (Registered 13 March 2018)", "Name of donor: Manchester City Football Club Ltd Address of donor: Etihad Stadium, Etihad Campus, Manchester M11 3FF Amount of donation, or nature and value if donation in kind: Four tickets plus hospitality for a Manchester City match, with a total value of £2,400 Date received: 7 April 2018 Date accepted: 7 April 2018 Donor status: company, registration 00040946 (Registered 30 April 2018)"]}}, "Ben Bradshaw": {"2018-06-04": {"Employment and earnings": ["Payment from ComRes, Coveham House, Downside Bridge Road, Cobham KT11 3EP, for opinion surveys:", "12 June 2017, payment of £75. Hours: 30 mins. (Registered 20 October 2017)", "22 August 2017, payment of £50. Hours: 30 mins. (Registered 20 October 2017)", "22 September 2017, payment of £75. Hours: 30 mins. (Registered 20 October 2017)", "29 September 2017, payment of £150. Hours: 1 hr. (Registered 20 October 2017)", "17 November 2017, payment of £75. Hours: 30 mins. (Registered 23 November 2017)"], "(b) Any other support not included in Category 2(a)": ["Name of donor: BM Creative Management Ltd Address of donor: 4th Floor York House, 23 Kingsway, London WC2B 6UJ Amount of donation or nature and value if donation in kind: £3,000 Date received: 28 April 2017 Date accepted: 28 April 2017 Donor status: company, registration 05635995 (Registered 27 June 2017)", "Name of donor: Lord Matthew Oakeshott Address of donor: private Amount of donation or nature and value if donation in kind: £5,000 Date received: 4 May 2017 Date accepted: 4 May 2017 Donor status: individual (Registered 27 June 2017)"], "Miscellaneous": ["I am a member of the Humboldt Advisory Board, Humboldt University, Mohrenstraffe 60, 10117 Berlin. Where possible, I attend annual Advisory Board meetings in Berlin, the costs of which are met by the University. To date, these have been below the registrable threshold.  (Registered 8 October 2013; updated 10 June 2014 and 19 October 2015)", "From 22 November 2011, a Trustee of the Terrence Higgins Trust. (Registered 24 February 2016)"]}}, "Graham Brady": {"2018-06-04": {"Employment and earnings": ["Lay Associate Member of the Medical Practitioners Tribunal Service, 3 Hardman Street, Manchester M3 3AW; formerly the General Medical Council Fitness to Practice Panel. (Registered 1 December 2011; updated 6 November 2012 and 17 January 2017)", "Fee of £930 received 2 September 2016. Hours: 5 hrs. (Registered 5 September 2016; updated 5 July 2017)", "Fee of £775 received on 14 September 2017. Hours: 5 hrs. (Registered 18 September 2017)", "Fee of £317 received on 12 January 2018. Hours: 3 hrs. (Registered 15 January 2018)", "Adviser on communications and marketing strategy to Snowshill Allied Holdings Ltd,  and formerly to Aquarium Software Ltd, both of Poplar House, 126a Ashley Road, Hale, Cheshire WA14 2UN. From 1 April 2015 until further notice I expect to receive remuneration of £2,500 a quarter, for a commitment of about 3 hours a quarter. (Registered 17 September 2013; updated 4 October 2013 and 31 May 2015)", "From 19 June 2017 a year I receive £26,000 a year (paid monthly) for my role as Editor of The House Magazine (Dods Parliamentary Services), Level 11, The Shard, 32 London Bridge Rd, London SE1 9SG. Hours: 10 hrs a month. (Updated 31 May 2015, 13 November 2015 and 3 July 2017)", "From 15 June 2015 until 30 June 2017, I received £1,200 a month for my role as Adviser to Relish Networks PLC (formerly UKB Network Ltd), a telecoms service provider, of 5th Floor, 236 Gray’s Inn Road, London WC1X 8HB. Expected commitment of 3 hrs a month. (Registered 09 July 2015; updated 03 October 2016 and 3 July 2017)", "18 January 2018, received £150 from the BBC, Broadcasting House, Portland Place, London, W1A 1AA for participation in the panel of Any Questions on Radio 4 on 11 January 2018. Hours: 1 hr. (Registered 19 January 2018)", "26 January 2018, received £165 from the Telegraph Media Group Ltd, 111 Buckingham Palace Road, London SW1W 0DT, for an article published on 12 June 2017. Hours: 2 hrs. (Registered 30 January 2018)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Mr David E M Mond Address of donor: private Amount of donation, or nature and value if donation in kind: £2,000 Donor status: individual (Registered 03 July 2017)", "Name of donor: Lady Beryl Steinberg Address of donor: private Amount of donation, or nature and value if donation in kind: £2,000 Donor status: individual (Registered 03 July 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: British Association for Shooting and Conservation (BASC) Address of donor: Marford Mill, Rossett, Wrexham LL12 0HL Amount of donation or nature and value if donation in kind: one day’s shooting at Catton Hall, South Derbyshire and one night’s accommodation at Hoar Cross Hall Hotel, Staffordshire: £825.45 in total Date received: 15 December 2017 Date accepted: 15 December 2017 Donor status: Registered Industrial and Provident Society No. 28488R (Registered 15 January 2018)"], "Visits outside the UK": ["Name of donor: Euro-Gulf Information Centre Address of donor: 12 Via Gregoriana, Rome, Italy 00187 Estimate of the probable value (or amount of any donation): Travel and accommodation for me and my spouse with a value of £900 Destination of visit: Prague Dates of visit: 19 - 21 June 2017 Purpose of visit: Attending and speaking at a conference. (Registered 26 July 2017)", "Name of donor: (1) London City Airport (2) Airbus Address of donor: (1) Royal Docks, London E16 2PB (2) 316 Route de Bayonne, 31300 Toulouse, France Estimate of the probable value (or amount of any donation): For me and my spouse (1) Travel and accommodation with a value of £540 (2) Transport and hospitality with a value of £580 Destination of visit: Toulouse Dates of visit: 24 – 26 August 2017 Purpose of visit: Visit to the Airbus Factory. (Registered 18 September 2017; updated 23 October 2017)", "Name of donor: Government of Gibraltar Address of donor: Gibraltar House, The Strand, London WC2R 1JA Estimate of the probable value (or amount of any donation): Travel and accommodation for me and my spouse with a value of £877 Destination of visit: Gibraltar Dates of visit: 7 – 10 September 2017 Purpose of visit: Gibraltar Day. (Registered 18 September 2017)"], "Miscellaneous": ["I have been given honorary membership of the Carlton Club for the tenure of my position of Chairman of the 1922 Committee. (Registered 05 September 2012)", "From 29 September 2015, member of the Hamblin Educational Trust, a multi-academy trust based at Altrincham Grammar School For Boys. This is an unpaid role. (Registered 07 December 2016)", "From 20 September 2016, unpaid Director of the Centre for Policy Studies; an independent think tank. (Registered 20 December 2016)"], "Family members employed and paid from parliamentary expenses": ["I employ my wife, Victoria Lowther, as Senior Research/Parliamentary Assistant."]}}, "Mickey Brady": {"2018-06-04": {"No records held": "Nil"}}, "Tom Brake": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Best for Britain Address of donor: 11 Manchester Square, London W1U 3PW Amount of donation, or nature and value if donation in kind: £2,000 Donor status: company, registration 10436078 (Registered 29 June 2017)"], "(b) Any other support not included in Category 2(a)": ["Name of donor: Adam and Helen Heathfield Address of donor: private Date received: 26 April 2017 Date accepted: 26 April 2017 Amount of donation, or nature and value if donation in kind: £5,000 Donor status: individuals (Registered 05 July 2017)", "Name of donor: Eddie Powell Address of donor: private Date received: 8 May 2017 Date accepted: 8 May 2017 Amount of donation, or nature and value if donation in kind: £10,000 Donor status: individual (Registered 05 July 2017)", "Name of donor: Lord Matthew Oakeshott Address of donor: private Date received: 20 May 2017 Date accepted: 20 May 2017 Amount of donation, or nature and value if donation in kind: £5,000 Donor status: individual (Registered 05 July 2017)", "Name of donor: John Garnsworthy Address of donor: private Date received: 25 May 2017 Date accepted: 25 May 2017 Amount of donation, or nature and value if donation in kind: £5,000 Donor status: individual (Registered 05 July 2017)", "Name of donor: John and Elaine Drage Address of donor: private Date received: 29 June 2017 Date accepted: 29 June 2017 Amount of donation, or nature and value if donation in kind: £3,445 in monthly donations of £287 Donor status: individuals (Registered 05 July 2017)"], "Visits outside the UK": ["Name of donor: Government of Gibraltar Address of donor: 6 Convent Place, Gibraltar GX11 1AA Estimate of the probable value (or amount of any donation): Flight £251, meals £120 and hotel accommodation with a value of £258; total value £629 Destination of visit: Gibraltar Dates of visit: 16-18 May 2018 Purpose of visit: Fact finding mission to assess impact of Brexit on Gibraltar. (Registered 24 May 2018)"]}}, "Suella Braverman": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Onecom Ltd Address of donor: Onecom House, 4400 Parkway, Solent Business Park, Fareham, Hampshire PO15 7FG Amount of donation or nature and value if donation in kind: £5,000 Donor status: company, registration 4031272 (Registered 05 July 2017; updated 14 March 2018)"], "(b) Any other support not included in Category 2(a)": ["Name of donor: Mr Harold Kewish Address of donor: private Amount of donation, or nature and value if donation in kind: £1,000 Date received: 3 May 2017 Date accepted: 3 May 2017 Donor status: individual (Registered 03 January 2018)", "Name of donor: Mr Harold Kewish Address of donor: private Amount of donation, or nature and value if donation in kind: £1,000 Date received: 10 December 2017 Date accepted: 12 December 2017 Donor status: individual (Registered 03 January 2018)", "Name of donor: Klassik Property Ltd Address of donor: 96-98 Braemar Avenue, South Croydon CR2 0QB Amount of donation, or nature and value if donation in kind: £3,000 Date received: 8 February 2018 Date accepted: 8 February 2018 Donor status: company, registration 04886023 (Registered 01 March 2018)"], "Miscellaneous": ["I am a member and director of Michaela Community School, a company (registration 07645701) limited by guarantee, incorporated 24 May 2011, and a registered charity. (Registered 05 June 2015)"]}}, "Kevin Brennan": {"2018-06-04": {"Employment and earnings": ["Fees received for appearing as part of Parliamentary rock band \"MP4\" on the Dave TV series ‘Unspun’ produced by Avalon Productions of 4A Exmoor St, London W10 6BD:", "7 April 2017, received £3,600 for shows between 28 February and 4 April 2017. Hours: 30 hrs (5 hrs per week). (Registered 12 June 2017)", "12 July 2017, received £620 for live show and rehearsal on 15 December 2016. Hours: 5 hrs. (Registered 17 July 2017)", "13 April 2018, received £4,800 for shows between 28 January and 24 March 2018. Hours: 36 hours (4.5 hours per week). (Registered 17 April 2018)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Musicians' Union Address of donor: 60-62 Clapham Road, London SW9 0JJ Amount of donation or nature and value if donation in kind: £5,000 for the General Election Donor status: trade union (Registered 20 July 2017)", "Name of donor: GMB Wales Address of donor: 17 Newport Road, Cardiff CF24 0TB Amount of donation or nature and value if donation in kind: £2,500 for the General Election Donor status: trade union (Registered 20 July 2017)", "Name of donor: Unite the Union Address of donor: 1 Cathedral Road, Cardiff CF11 9SD Amount of donation or nature and value if donation in kind: £6,000 for the General Election Donor status: trade union (Registered 20 July 2017)", "Name of donor: Best for Britain campaign Address of donor: 11 Manchester Square, London W1U 3PW Amount of donation or nature and value if donation in kind:  £2,000 for the General Election Donor status: company, registration 10436078 (UK-EU Open Policy Ltd) (Registered 10 August 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: UK Music Address of donor: 49 Whitehall, London SW1A 2BX Amount of donation, or nature and value if donation in kind: Ticket and hospitality as Shadow Culture Minister to attend the Mercury Music Prize, value £570 (inc VAT) Date received: 14 September 2017 Date accepted: 14 September 2017 Donor status: company, registration 3245288 (Registered 13 October 2017; updated 3 November 2017)"]}}, "Jack Brereton": {"2018-06-04": {"Employment and earnings": ["Councillor, Stoke on Trent City Council, Civic Centre, Glebe Street, Stoke-on-Trent ST4 1HH. Until May 2019, I will receive an allowance of £12,000 per annum. Hours: 5-10 hrs per week. This allowance will be donated to local charities. (Registered 05 July 2017)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Mr Jeremy Hosking Address of donor: private Amount of donation, or nature and value if donation in kind: £5,000 Donor status: individual (Registered 07 July 2017)"]}}, "Andrew Bridgen": {"2018-06-04": {"Employment and earnings": ["Payments from Ipsos MORI, 3 Thomas More Square, London E1W 1YW, for opinion surveys. All payments donated to North West Leicestershire Conservative Association.", "23 January 2017, received £50 for survey completed on 7 December 2016. Hours: 20 mins. (Registered 06 July 2017)", "27 February 2017, received £200 for survey completed on 6 December 2016. Hours: 1 hr. (Registered 06 July 2017)", "30 June 2017, received £80 for survey completed on 19 April 2017. Hours: 30 mins. (Registered 06 July 2017)", "3 August 2017, received £200 for survey completed on 4 July 2017. Hours: 1 hr. (Registered 16 August 2017)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: JS Bloor (Services) Ltd Address of donor: Ashby Road, Measham, Swadlincote DE12 7JP Amount of donation or nature and value if donation in kind: £12,000, which included £2,000 for another constituency Donor status: company, registration 2164993 (Registered 05 July 2017)", "Name of donor: Yew Lodge Ltd Address of donor: 33 Packington Hill, Kegworth DE74 2DF Amount of donation or nature and value if donation in kind: £5,000 Donor status: company, registration 00719573 (Registered 05 July 2017)", "Name of donor: Norton Motorcycles Address of donor: Hastings House, Castle Donington DE74 2SG Amount of donation or nature and value if donation in kind: £2,500 Donor status: company, registration 06718623 (Registered 05 July 2017)"], "(i) Shareholdings: over 15% of issued share capital": ["AB Produce PLC; processing and distribution of fresh vegetables.", "AB Produce Trading Ltd; holding company.", "Bridgen Investments Ltd; investment company, investing in shares, property, building projects.", "From 6 February 2017, AB Farms Ltd; potato production and storage. (Registered 21 March 2017)"]}}, "Steve Brine": {"2018-06-04": {"Gifts, benefits and hospitality from UK sources": ["Name of donor: PRS for Music Address of donor: 2 Pancras Square, London N1C 4AG Amount of donation or nature and value if donation in kind: Two tickets to Glastonbury and accommodation with a total value of £1,108.32 (£950 for tickets and £158.32 for accommodation) Date received: 23 June 2017 Date accepted: 23 June 2017 Donor status: company, registration 03444246 (Registered 11 July 2017)"]}}, "Deidre Brock": {"2018-06-04": {"(b) Any other support not included in Category 2(a)": ["Name of donor: Angus Crichton-Miller Address of donor: private Amount of donation or nature and value if donation in kind: £2,500 Date received: 26 April 2017 Date accepted: 28 April 2017 Donor status: individual (Registered 05 July 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["My partner and I have half share ownership (in total) of two flats in Edinburgh: (i). (Registered 05 June 2015)"]}}, "James Brokenshire": {"2018-06-04": {"Gifts, benefits and hospitality from UK sources": ["Name of donor: Randox Laboratories Ltd Address of donor: 55 Diamond Road, Crumlin BT29 4QY Amount of donation, or nature and value if donation in kind: Tickets and hospitality for the Randox Grand National for myself and my wife, to an estimated value of £2,000 Date received: 14 April 2018 Date accepted: 14 April 2018 Donor status: company, registration NI015738 (Registered 09 May 2018)"], "Miscellaneous": ["I am a non-practising solicitor."]}}, "Alan Brown": {"2018-06-04": {"Miscellaneous": ["Unremunerated director of Newmilns Snow and Sports Complex. (Registered 04 June 2015)"]}}, "Lyn Brown": {"2018-06-04": {"Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["One quarter share in a rental property in Ambleside, Cumbria: (i) and (ii). (Updated 26 July 2016)", "A half share in a commercial property in Munich, Germany: (i) and (ii). (Updated 3 August 2016)"]}}, "Nick Brown": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: GMB Address of donor: 1 Mosley Street, Newcastle Upon Tyne NE1 1YE Amount of donation or nature and value if donation in kind: £5,000 Donor status: trade union (Registered 04 July 2017)", "Name of donor: Communication Workers Union (CWU) Address of donor: 150, the Broadway, Wimbledon, London SW19 1RX Amount of donation or nature and value if donation in kind: £2,000 Donor status: trade union (Registered 04 July 2017)", "Name of donor: Unite the Union Address of donor: 128 Theobalds Road, Holborn, London WC1X 8TN Amount of donation or nature and value if donation in kind: printing to the value of £4,000 Donor status: trade union (Registered 04 July 2017)"], "Miscellaneous": ["Since September 1980, an Associate Governor of Walker Technology College. (Registered 04 July 2017)", "Since October 2012, a Non-Executive Director of Mariinksky Theatre Trust. (Registered 04 July 2017)", "Since January 2011, a trustee of the Biscuit Factory Foundation. (Registered 04 July 2017)"]}}, "Fiona Bruce": {"2018-06-04": {"Employment and earnings": ["Fiona Bruce and Co LLP; solicitors practice.  Address:  Justice House, 3 Grappenhall Rd, Stockton Heath, Warrington WA4 2AH. Consultancy fees received:", "30 May 2017, received £5,000. Hours: 7 hrs. (Registered 15 June 2017)", "30 June 2017, received £5,000. Hours: 8 hrs. (Registered 27 July 2017)", "31 July 2017, received £41,849.05. Hours: 12 hrs. (Registered 31 August 2017)", "31 August 2017, received £5,000. Hours: 23 hrs. (Registered 25 September 2017)", "30 September 2017, received £5,000. Hours: 9 hrs. (Registered 27 October 2017)", "31 October 2017, received £5,000. Hours: 9 hrs. (Registered 29 November 2017)", "30 November 2017, received £5,000. Hours: 8 hrs. (Registered 28 December 2017)", "31 December 2017, received £5,000. Hours: 7 hrs. (Registered 29 January 2018)", "31 January 2018, received £94,040.98. Hours: 12 hrs. (Registered 27 February 2018)", "28 February 2018, received £5,000. Hours: 12 hrs. (Registered 28 March 2018)", "31 March 2018, received £5,000. Hours: 12 hrs. (Registered 03 May 2018)", "30 April 2018, received £5,000. Hours: 10 hrs. (Registered 14 May 2018)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Four residential properties in Warrington, Cheshire: (i) and (ii). The fourth property was purchased on 1 February 2016. (Updated 11 November 2013 and 16 February 2016)", "Four commercial properties in Warrington, Cheshire: (i) and (ii).", "One commercial property in Knutsford, Cheshire: (i) and (ii). (Registered 31 May 2010)"]}}, "Chris Bryant": {"2018-06-04": {"Employment and earnings": ["Payments from Doubleday/Transworld Publishers, 20 Vauxhall Bridge Road, London SW1V 2SA:", "20 April 2017, received £10,250 in payment for an advance against royalties for a new book. Hours: estimated at 600 hrs over 3 years. (Registered 29 June 2017)", "8 September 2017, received £9,544.50 on publication of a new book. Hours: no additional hours. (Registered 26 October 2017)", "13 February 2018, received £8,200 from Bloomsbury Publishing PLC, 50 Bedford Square, London WC1B 3DP, as an advance for a new book. Hours: impossible to calculate. (Registered 14 February 2018)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Best for Britain (UK-EU Open Policy Ltd) Address of donor: 11 Manchester Square, London W1U 3PW Amount of donation or nature and value if donation in kind: £2,000 towards my election expenses Donor status: company, registration 10436078 (Registered 05 July 2017)", "Name of donor: More United Address of donor: 32 Great Peter Street, London SW1P 2DB Amount of donation or nature and value if donation in kind: £2,000 towards my election expenses Donor status: company, registration 10285790 (Registered 07 July 2017)", "Name of donor: Unison Address of donor: 130 Euston Road, London NW1 2AY Amount of donation or nature and value if donation in kind: £3,000 Donor status: trade union (Registered 07 July 2017)"]}}, "Karen Buck": {"2018-06-04": {"Visits outside the UK": ["Name of donor: APPG on Population, Development and Reproductive Health (with sponsorship from the European Parliamentary Forum on Population and Development) Address of donor: House of Commons, London SW1A 0AA Estimate of the probable value (or amount of any donation): International flights £588.89; internal flights £118; van hire £84; minicabs £39.15; hotels in Addis £267.20 and Axum £52.25; per diem £105; food and misc £137; visa £41.60; total £1,463.09 Destination of visit: Ethiopia (Addis Ababa and refugee camp in Shire, Tigray Province) Dates of visit: 5-11 November 2017 Purpose of visit: Ethiopian Study Tour concerning women's health. (Registered 14 December 2017)"]}}, "Robert Buckland": {"2018-06-04": {"Employment and earnings": ["Queen’s Counsel.", "Crown Court Recorder (part-time circuit judge).", "Payments from Ipsos MORI, 3 Thomas More Square, London E1W 1YW, for an opinion surveys:", "20 December 2017, payment of £200. Hours: 1 hr. Fee donated to local charity. (Registered 10 January 2018)", "14 September 2017, payment of £200. Hours: 1 hr. Fee paid direct to local charity. (Registered 06 February 2018)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Wasdell Packaging Ltd Address of donor: Unite 6-8, Euro Way, Blagrove, Swindon SN5 8YW Amount of donation or nature and value if donation in kind: £15,000 Donor status: company, registration 00956939 (Registered 29 June 2017)"], "Miscellaneous": ["Practising barrister but no fee-paying work done since June 2010. (Updated 5 January 2015)"], "Family members employed and paid from parliamentary expenses": ["I employ my wife, Sian Buckland, as a part time caseworker. (Registered 13 July 2016)"]}}, "Richard Burden": {"2018-06-04": {"Employment and earnings": ["Payments from ComRes, Four Millbank, London, SW1P 3JA, for opinion surveys. Unless otherwise stated, all fees paid direct to my local party organisation:", "28 February 2017, £100 paid. Hours: 30 mins. (Registered 14 November 2017)", "7 June 2017, £75 paid. Hours: 30 mins. (Registered 14 November 2017)", "22 September 2017, £75 paid. Hours: 30 mins. (Registered 14 November 2017)", "29 September 2017, £75 paid. Hours: 30 mins. (Registered 14 November 2017)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Communication Workers Union Address of donor: 46-8 Summer Lane, Birmingham B18 3TH Amount of donation, or nature and value if donation in kind: £3,500 Donor status: trade union (Registered 12 June 2017)", "Name of donor: Unite the Union Address of donor: 128 Theobalds Rd, London WC1X 8TN Amount of donation, or nature and value if donation in kind: £4,000 Donor status: trade union (Registered 12 June 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: The British Automobile Racing Club Address of donor: 17 White House Grove, Elvington, York YO41 4AL Amount of donation or nature and value if donation in kind: Two passes to British Touring Car Championship 2017 rounds, total value for year approx. £785 Date received: 31 March 2017 Date accepted: 31 March 2017 Donor status: company, registration 05246427 (Registered 03 April 2017)", "Name of donor: Motor Sports Association Address of donor: Riverside Park, Colnbrook SL3 0HG Amount of donation or nature and value if donation in kind: two passes and hospitality for 2017 British Grand Prix at Silverstone, value £1,084 (£542 per person) Date received: 16 July 2017 Date accepted: 16 July 2017 Donor status: company, registration 1344829 (Registered 20 July 2017)", "Name of donor: The British Automobile Racing Club Address of donor: 17 White House Grove, Elvington, York YO41 4AL Amount of donation or nature and value if donation in kind: Two passes to British Touring Car Championship 2018 rounds, total value for year approx. £814 Date received: 31 March 2018 Date accepted: 31 March 2018 Donor status: company, registration 05246427 (Registered 09 April 2018)"]}}, "Alex Burghart": {"2018-06-04": {"Employment and earnings": ["28 March 2018, received £200 from the Spectator, 22 Old Queen Street, London SW1H 9HP, for a book review. Hours: 6 hrs. (Registered 28 March 2018)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Michael Farmer Address of donor: private Amount of donation or nature and value if donation in kind: £3,000 Donor status: individual (Registered 04 July 2017)"], "Visits outside the UK": ["Name of donor: Kingdom of Saudi Arabia Ministry of Foreign Affairs Address of donor: Al Washm Street, Namudhajiyah Riyadh 12735, Saudi Arabia Estimate of the probable value (or amount of any donation): flights, transport, food and accommodation with a value of £7,800 Destination of visit: Riyadh and Jeddah, Saudi Arabia Dates of visit: 24-29 September 2017 Purpose of visit: to meet with HM King Salman Abdulaziz Ibn Saud, senior government officials and business leaders and the British diplomatic team in order to support and understand the British-Saudi bilateral relationship. (Registered 12 October 2017)"]}}, "Richard Burgon": {"2018-06-04": {"Employment and earnings": ["3 January 2018, payment of £200 from Ipsos MORI, 3 Thomas More Square, London E1W 1YW, for a survey. Hours: 1 hr. Fee paid direct to Leeds East CLP. (Registered 30 January 2018)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Unite the Union Address of donor: 128 Theobald's Road, Holborn, London WC1X 8TN Amount of donation or nature and value if donation in kind: £9,000 Donor status: trade union (Registered 07 July 2017)", "Name of donor: GMB Address of donor: Grove Hall, 60 College Road, Wakefield WF1 3RN Amount of donation or nature and value if donation in kind: £5,000 Donor status: trade union (Registered 07 July 2017)", "Name of donor: Unite the Union Address of donor: 128 Theobald's Road, London WC1X 8TN Amount of donation, or nature and value if donation in kind: £13,135 to fund a member of staff in my constituency office Donor status: trade union (Registered 30 May 2018)"], "(b) Any other support not included in Category 2(a)": ["Name of donor: Unite the Union Address of donor: 128 Theobald’s Road, London SW1X 8TN Amount of donation, or nature and value if donation in kind: £1,735.78 for mailings to constituents Date received: 12 February 2018 Date accepted: 12 February 2018 Donor status: trade union (Registered 01 March 2018)"], "Miscellaneous": ["Non-practising solicitor. (Registered 06 June 2015)"]}}, "Conor Burns": {"2018-06-04": {"Employment and earnings": ["Consultant to Trant Engineering Ltd, formerly Trant Construction Ltd, Rushington, Southampton SO40 9LT.  Until further notice, I receive £10,000 quarterly for 10 hours work per month. (Registered 27 June 2011; updated 14 July 2015 and 12 October 2015)", "Until 31 July 2017, Consultant to Quantum Group Ltd, 170 Charminster Road, Bournemouth BH8 9RL. I received £6,250 quarterly for 6 hours work per month. (Registered 14 December 2015; updated 03 October 2016 and 06 September 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["House in Southampton: (i). (Updated 6 November 2012)"]}}, "Alistair Burt": {"2018-06-04": {"Visits outside the UK": ["Name of donor: United Arab Emirates Ministry of Foreign Affairs (MOFA) Address of donor: Al Bateen, Abu Dhabi, United Arab Emirates Estimate of the probable value (or amount of any donation): Travel and accommodation for myself and spouse with a value of £10,000 Destination of visit: Abu Dhabi, United Arab Emirates Dates of visit: 3-5 November 2017 Purpose of visit: Attendance at the Sir BaniYas Forum 2017 at the invitation of the MOFA. (Registered 30 November 2017)"], "Family members employed and paid from parliamentary expenses": ["I employ my wife, Eve Burt, as Office Manager."]}}, "Dawn Butler": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Unite the Union Address of donor: 128 Theobalds Road, Holborn, London WC1X 8TN Amount of donation or nature and value if donation in kind: £4,000 Donor status: trade union (Registered 07 July 2017)", "Name of donor: Elite Mobile Ltd Address of donor: Wembley Stadium Industrial Estate, First Way, Wembley HA9 0TU Amount of donation, or nature and value if donation in kind: £2,500 given to my local party for sponsorship of 2018 calendars Donor status: company, registration 02987598 (Registered 26 March 2018)"], "Visits outside the UK": ["Name of donor: Anthony Watson Address of donor: private Estimate of the probable value (or amount of any donation): For a member of staff and myself, flights, accommodation and tickets to the GLAAD awards, with a total value of £14,200 (£7,100 per person) Destination of visit: Los Angeles Dates of visit: 6-15 April 2018 Purpose of visit: Women and Equalities LGBT fact finding visit. (Registered 25 April 2018)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["House in Newham: (i). (Registered 08 June 2015)"]}}, "Liam Byrne": {"2018-06-04": {"Employment and earnings": ["From November 2017, lecturer at Said Business School, Oxford University, Park End Street, Oxford OX1 1HP:", "13 January 2018, payment of £1,500. Hours: 3 hrs. (Registered 18 January 2018)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Sir T E Chinn Address of donor: private Amount of donation or nature and value if donation in kind: £2,500 Donor status: individual (Registered 27 June 2017)"], "Visits outside the UK": ["Name of donor: Shura Council of Saudi Arabia Address of donor: Al Yamamah Palace, Riyadh, Saudi Arabia Estimate of the probable value (or amount of any donation): Flights and accommodation £6,080; internal transport and hospitality £642.14; total value £6,722.14 Destination of visit: Riyadh, Saudi Arabia Dates of visit: 9-13 April 2017 Purpose of visit: To strengthen British Saudi Arabian diplomatic relations. (Registered 09 June 2017)", "Name of donor: (1) Great Britain China Centre (with sponsorship from BP and Prudential)  (2) International Liaison Department of the Chinese Communist Party (IDCPC) Address of donor: (1) 15 Belgrave Square, London SW1X 8PS  (2) No.4 Fuxing Road, Beijing Estimate of the probable value (or amount of any donation): (1) Airfare £2,336; hotel and breakfast in Beijing £232.56; total £2,568.56  (2) food and drink (estimated at £60/day) £180; domestic travel (estimated at £10/day) £30; total £210 Destination of visit: Beijing, China Dates of visit: 9-11 April 2018 Purpose of visit: To attend the 2018 UK-China Leadership Forum, organised by the Great Britain China Centre and IDCPC; to engage with Chinese Communist Officials on a broad range of topics and to strengthen UK-China bilateral relations. (Registered 24 April 2018)", "Name of donor: Parliamentary Network on the World Bank and IMF Address of donor: 66 Avenue d’Iéna, 75116 Paris Estimate of the probable value (or amount of any donation): Airfare and hotel £2,147; domestic travel £69; total value £2,216 Destination of visit: Washington DC, USA Dates of visit: 14-18 April 2018 Purpose of visit: To attend the IMF/World Bank Global Parliamentary Network Conference, focusing on global youth unemployment. (Registered 21 May 2018)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["From August 2017, rental income from my London home, which is paid to my wife and is below registrable level: (i). (Registered 04 June 2018)"]}}, "Vincent Cable": {"2018-06-04": {"Employment and earnings": ["£2,500 paid direct to charity on 30 June 2017 in respect of my services as non-executive director of White Capstan (a subsidiary of the Purico Group), of Environment House, 6 Union Road, Nottingham NG3 1FH which is engaged in chrome plating, supply of speciality papers to food and industrial markets and the management of a leisure facility in Derbyshire. I resigned on 2 July 2017. Hours: none since the General Election. (Registered 07 July 2017)", "Payments received for speaking engagements via DBA Speakers, of 58 Station Avenue, Walton on Thames, Surrey KT12 1NQ:", "30 October 2017, received £6,000  from the Chartered Institute of Internal Auditors, of 88 Clapham Park Rd, London SW4 7BX  Fee donated to charity. Hours: 2 hrs. (Registered 1 November 2017; updated 15 December 2017)", "15 December 2017, received £5,000 for speaking at a conference from the Personal Finance Society, 20 Aldermanbury, London EC2V 7HY. Fee donated to local charities. Hours: 4 hrs. (Registered 03 January 2018)", "Payments from Atlantic Books, Ormond House, 27 Boswell St, London WC1N 3JZ, via Georgina Capel Associates, 29 Wardour St, London W1D 6PS:", "10 October 2017, received £4,100 in book royalties. Hours: none since my re-election. (Registered 23 November 2017)", "21 November 2017, received £2,050 in book royalties. Hours: none since my re-election. (Registered 15 December 2017)"]}}, "Ruth Cadbury": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Communication Workers Union Address of donor: 150 The Broadway, London SW19 1RX Amount of donation or nature and value if donation in kind: £2,000 Donor status: trade union (Registered 07 July 2017)", "Name of donor: GMB Address of donor: 22 Stephenson Way, Euston, London NW1 2HD Amount of donation or nature and value if donation in kind: £7,500 Donor status: trade union (Registered 07 July 2017)", "Name of donor: More United Ltd Address of donor: 49 Knatchbull Road, London SE5 9QR Amount of donation or nature and value if donation in kind: £3,000 Donor status: company, registration 10285790 (Registered 07 July 2017)", "Name of donor: Friends of Windsor Labour Hall Address of donor: 4 Knights Close, Windsor SL4 5QR Amount of donation or nature and value if donation in kind: £4,555 Donor status: friendly society (Registered 07 July 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["One house in Brentford: (i) and (ii). (Registered 08 June 2015)"], "Family members engaged in lobbying the public sector on behalf of a third party or client": ["My husband, Nicholas Gash, is a self employed sole trader, providing policy and public affairs advice to clients. (Registered 08 June 2015)"]}}, "Alun Cairns": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: J C Bamford Ltd Address of donor: Rocester, Staffordshire ST14 5JP Amount of donation or nature and value if donation in kind: £3,000 Donor status: company, registration 00561597 (Registered 04 July 2017)", "Name of donor: Mr Duncan Barber Address of donor: private Amount of donation or nature and value if donation in kind: £4,000 Donor status: individual (Registered 04 July 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Residential property in Cardiff: (i) and (ii)."]}}, "Lisa Cameron": {"2018-06-04": {"Employment and earnings": ["From 1 August 2015 until 30 June 2017, I received £150 a month from Psychological Services Scotland Ltd, Atrium Business Centre, North Caldeen Road, ML5 4EP. This was for approximately five hours’ work supervising reports written by an assistant forensic psychologist. (Registered 26 August 2015; updated 11 August 2017)", "From 15 January 2016 until 14 May 2018, I received £353.73 each month from NHS Greater Glasgow & Clyde, 140 Fifty Pitches Rd, Glasgow G51 4ED, for carrying out psychological assessment and treatment. Hours: 9-10 hrs per month. (Registered 11 February 2018; updated 30 May 2018)", "29 September 2017, payment of £200 from Ipsos MORI, 3 Thomas More Square, London E1W 1YW, for completing a survey. Hours: 1 hr. Fee paid direct to SNP West Clydesdale Branch. (Registered 05 October 2017)"], "Visits outside the UK": ["Name of donor: Hong Kong Government Address of donor: c/o Hong Kong Economic & Trade Office, 18 Bedford Square, London WC1B 3JA Estimate of the probable value (or amount of any donation): Flights, accommodation, transport, hospitality and food with a total value of £10,359 Destination of visit: Hong Kong Dates of visit: 9-13 January 2017 Purpose of visit: To support bilateral relationship and business development between UK and Hong Kong and to gain understanding of Hong Kong's political, social and economic development. (Registered 30 June 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["One house in South Lanarkshire: (i) and (ii). (Registered 05 June 2015)", "Five residential and holiday let apartments in Edinburgh and South Lanarkshire: (i) and (ii). (Registered 05 June 2015)"], "(i) Shareholdings: over 15% of issued share capital": ["Psychological Services Scotland Ltd, psychology assessment. (Registered 05 June 2015)"], "Miscellaneous": ["From 24 February 2016, unremunerated director of UK Japan 21C Group. (Registered 28 April 2016)", "From 19 September 2017, a trustee/director of the Industry and Parliament Trust. (Registered 19 September 2017)"]}}, "Alan Campbell": {"2018-06-04": {"Employment and earnings": ["1 September 2017, received £200 from Ipsos MORI, 3 Thomas More Square, London E1W 1YW, for a survey completed on 14 August 2017. Hours: 1 hr. (Registered 22 September 2017)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: USDAW Address of donor: 188 Wilmslow Road, Manchester M14 6LJ Amount of donation or nature and value if donation in kind: £2,000 Donor status: trade union (Registered 06 July 2017)", "Name of donor: GMB Address of donor: 1 Mosley Street, Newcastle Upon Tyne NE1 1YE Amount of donation or nature and value if donation in kind: £5,000 Donor status: trade union (Registered 06 July 2017)"], "Family members employed and paid from parliamentary expenses": ["Between January and March 2017, I employed my daughter, Emily Campbell, as a part time Administrative Assistant. (Registered 06 July 2017)"]}}, "Gregory Campbell": {"2018-06-04": {"Employment and earnings": ["Payments from ComRes, Four Millbank London SW1P 3JA, for opinion surveys. All fees paid direct to East Londonderry DUP:", "7 October 2017, payment of £150  for two surveys in July and September 2017. Hours: 50 mins in total.  (Registered 25 October 2017)", "30 May 2017, payment of £75 for a survey in January 2017. Hours: 25 mins. (Registered 22 November 2017)", "22 September 2017, payment of £75 for a survey in February 2017. Hours: 25 mins. (Registered 22 November 2017)", "22 September 2017, payment of £75 for a survey in June 2017. Hours: 25 mins. (Registered 22 November 2017)", "17 November 2017, payment of £75 for a survey in October 2017. Hours: 25 mins. (Registered 23 January 2018)", "8 January 2018, payment of £100 for a survey in November 2017. Hours: 45 mins. (Registered 02 May 2018)", "7 February 2018, payment of £100 for a survey in January 2018. Hours: 45 mins. (Registered 02 May 2018)", "19 March 2018, payment of £75 for a survey in February 2018. Hours: 25 mins. (Registered 02 May 2018)", "23 April 2018, payment of £75 for a survey in March 2018. Hours: 25 mins. (Registered 02 May 2018)"], "Miscellaneous": ["Unremunerated interests currently registered on the NI Assembly website register do not appear here as they are not registrable under House of Commons rules."], "Family members employed and paid from parliamentary expenses": ["I employ my wife, Frances Campbell, as part-time Secretary."]}}, "Ronnie Campbell": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Unite Address of donor: 128 Theobald's Road, London WC1X 8TN Amount of donation or nature and value if donation in kind: £2,000 Donor status: trade union (Registered 07 July 2017)"], "Family members employed and paid from parliamentary expenses": ["I employ my wife, Deirdre Campbell, as a part time Caseworker. (Updated 1 June 2015)"]}}, "Dan Carden": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Unite the Union Address of donor: 128 Theobalds Road, London WC1X 8TN Amount of donation or nature and value if donation in kind: £20,000 Donor status: trade union (Registered 04 July 2017)"], "(b) Any other support not included in Category 2(a)": ["Name of donor: Unite the Union Address of donor: 128 Theobald's Road, London WC1X 8TN Amount of donation or nature and value if donation in kind: Secondment of a member of staff between 1 July and 30 September 2017, value £11,475.75 Date received: 1 July - 30 September 2017 Date accepted: 1 July 2017 Donor status: trade union (Registered 27 July 2017)"], "Gifts, benefits and hospitality from UK sources": ["Name of donor: Unite the Union Address of donor: 128 Theobald's Road, London WC1X 8TN Amount of donation or nature and value if donation in kind: Four nights' hotel accommodation during the Labour Party Conference with a value of £1,380 Date received: 23-27 September 2017 Date accepted: 23 September 2017 Donor status: trade union (Registered 20 October 2017)", "Name of donor: Jockey Club Racecourses Ltd Address of donor: 75 High Holborn, London WC1V 6LS Amount of donation, or nature and value if donation in kind: Hospitality provided to me and three guests at Haydock Racecourse with a value of £500 Date received: 23 December 2017 Date accepted: 23 December 2017 Donor status: company, registration 2909409 (Registered 19 January 2018; updated 30 January 2018)"], "Visits outside the UK": ["Name of donor: High Commission of India Address of donor: Aldwych, London WC2B 4NA Estimate of the probable value (or amount of any donation): Flights and accommodation costing £4,633 Destination of visit: Delhi, India Dates of visit: 5-11 November 2017 Purpose of visit: Familiarisation visit; meetings with government ministers and others. (Registered 06 December 2017; updated 12 January 2018)", "Name of donor: Medical Aid for Palestinians Address of donor: 33a Islington Park Street, London N1 1QB Estimate of the probable value (or amount of any donation): Flights, accommodation, food and transport with a total value of £854 Destination of visit: West Bank and Israel Dates of visit: 12-16 February 2018 Purpose of visit: Fact finding visit organised by the Council for Arab-British Understanding and Medical Aid for Palestinians. (Registered 07 March 2018)"]}}, "Alistair Carmichael": {"2018-06-04": {"(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Jeremy Nelson Address of donor: private Amount of donation or nature and value if donation in kind: £2,000 Donor status: individual (Registered 07 July 2017)", "Name of donor: Dinesh Dhamija Address of donor: private Amount of donation or nature and value if donation in kind: £5,000 Donor status: individual (Registered 07 July 2017)", "Name of donor: Joe Zammit-Lucia Address of donor: private Amount of donation or nature and value if donation in kind: £5,000 Donor status: individual (Registered 07 July 2017)"], "Visits outside the UK": ["Name of donor: Medical Aid for Palestinians Address of donor: 33a Islington Park Street, London N1 1QB Estimate of the probable value (or amount of any donation): Flights, accommodation, food and transport with a total value of £1,260 Destination of visit: West Bank and Israel Dates of visit: 28 August - 1 September 2017 Purpose of visit: Fact finding visit organised by the Council for Arab-British Understanding and Medical Aid for Palestinians. (Registered 08 September 2017)"], "Miscellaneous": ["From 22 September 2017, unremunerated Director of the Council for Arab-British Understanding. (Registered 12 October 2017)"]}}, "James Cartlidge": {"2018-06-04": {"(i) Shareholdings: over 15% of issued share capital": ["Share to Buy Ltd; property portal, mortgage broker and home shows (see category 8 below). (Registered 02 June 2015)", "Share to Buy (Advertising) Ltd; not trading (see category 8 below). (Registered 02 June 2015)"], "Miscellaneous": ["Unpaid director of Share to Buy Ltd and Share to Buy (Advertising) Ltd (not trading). (Registered 02 June 2015)"]}}, "Bill Cash": {"2018-06-04": {"Employment and earnings": ["Solicitor, William Cash & Co, The Tithe Barn, Upton Cresset, nr Bridgnorth, WV16 6UH.", "20 April 2018, received £28,000. Hours: 70 hrs. (Registered 03 May 2018)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: David E D Johnson Address of donor: private Amount of donation or nature and value if donation in kind: £5,000 Donor status: individual (Registered 29 June 2017)"], "Visits outside the UK": ["Name of donor: (1) The People’s Movement against the EU (2) The Red Cell (UK think tank) Address of donor: (1) Tordenskjoldsgade 21, st.th. DK-1055 Copenhagen K, Denmark (2) Lynton Mansions, McAuley Close, London SE1 7BW Estimate of the probable value (or amount of any donation): flights £313; one night’s accommodation £80; dinner £50 and taxi transfers £120. The total value of £563 was divided (1) £63 and (2) £500 between the donors. Destination of visit: Aarhus, Denmark Dates of visit: 28-29 October 2017 Purpose of visit: to receive award to me in Denmark for promoting democracy and international cooperation in Europe. (Registered 16 November 2017; updated 28 November 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Until September 2017, a half share in London rental property (residential): (i). (Registered 16 April 2012; updated 26 September 2017)"], "Miscellaneous": ["Unremunerated Chairman of the European Foundation, an EU reform think tank which produces the European Journal. (Registered 26 September 2017)"], "Family members employed and paid from parliamentary expenses": ["I employ my wife, Bridget Cash, as Parliamentary Assistant."]}}, "Maria Caulfield": {"2018-06-04": {"Employment and earnings": ["Registered nurse at Royal Marsden Hospital, Fulham Road, London SW1 6JJ:", "23 June 2017, received £122.10. Hours: 12 hrs. (Registered 04 July 2017)", "11 August 2017, received £128.02. Hours: 12 hrs. (Registered 14 August 2017)", "13 August 2017, received £119.99. Hours: 14 hrs. (Registered 04 September 2017)", "1 September 2017, received £122.08. Hours: 12 hrs. (Registered 04 September 2017)", "27 October 2017, received £156.47. Hours: 12 hrs. (Registered 20 November 2017)", "19 January 2018, received £122. Hours: 12 hrs. (Registered 06 February 2018)", "23 February 2018, received £156.46. Hours: 12 hrs. (Registered 12 March 2018)", "2 March 2018, received £187.80. Hours: 12 hrs. (Registered 12 March 2018)", "23 March 2018, received £128. Hours: 12 hrs. (Registered 16 April 2018)", "20 April 2018, received £192.65. Hours: 12 hrs. (Registered 08 May 2018)", "11 May 2018, received £156.87. Hours: 12 hrs. (Registered 14 May 2018)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: Mr Peter McDonnell Address of donor: private Amount of donation or nature and value if donation in kind: £5,000 Donor status: individual (Registered 30 June 2017)", "Name of donor: The United and Cecil Club Address of donor: New Penderel House, 283-287 High Holborn, London WC1V 7HF Amount of donation or nature and value if donation in kind: £2,500 Donor status: members' association (Registered 30 June 2017)", "Name of donor: Lord Michael Farmer Address of donor: private Amount of donation or nature and value if donation in kind: £2,000 Donor status: individual (Registered 30 June 2017)", "Name of donor: J C Bamford Excavators Ltd Address of donor: Lakeside works, Denstone Road, Rocester ST14 5JP Amount of donation or nature and value if donation in kind: £3,000 Donor status: company, registration 00561597 (Registered 05 July 2017)", "Name of donor: Clerewell Ltd Address of donor: London & Associated Properties plc, 24 Bruton Place, London W1J 6NE Amount of donation or nature and value if donation in kind: £2,000 Donor status: company, registration 01798514 (Registered 05 July 2017)", "Name of donor: The Tandridge Club Address of donor: Pains Hill Corner, Pains Hill, Oxted, RH8 0RB Amount of donation, or nature and value if donation in kind: £2,000 Donor status: unincorporated association (Registered 05 July 2017)"], "Visits outside the UK": ["Name of donor: HM Government of Gibraltar Address of donor: Gibraltar House, 150 Strand, London WC2R 1JA Estimate of the probable value (or amount of any donation): Travel and accommodation with a total value of £754.80 Destination of visit: Gibraltar Dates of visit: 7 – 10 September 2017 Purpose of visit: Gibraltar National Day celebrations. (Registered 02 October 2017)"], "Miscellaneous": ["From 8 January 2018, Vice Chairman of the Conservative Party. This post carries a part time salary. (Registered 06 February 2018)"], "Family members employed and paid from parliamentary expenses": ["I employ my partner, Steve Bell, as a Parliamentary Assistant. (Registered 04 January 2016; updated 22 March 2016)"]}}, "Alex Chalk": {"2018-06-04": {"Employment and earnings": ["Payments from the Crown Prosecution Service, 4-5 South Parade, Wakefield WF1 1LR, for legal services:", "10 May 2017, received £9,679.10. Hours: 45 hrs. (Registered 14 June 2017)", "16 May 2017, received £140.70. Hours: 2 hrs. (Registered 14 June 2017)", "13 September 2017, received £780. Hours: 9.75 hrs. (Registered 20 September 2017)", "4 October 2017, received £126. Hours: none since my election to the House. (Registered 10 October 2017)", "22 March 2018, received £284.70. Hours: none since my election to the House. (Registered 27 March 2018)", "13 April 2018, received £402. Hours: 4 hrs. (Registered 25 April 2018)"], "(a) Support linked to an MP but received by a local party organisation or indirectly via a central party organisation": ["Name of donor: John Armitage Address of donor: private Amount of donation or nature and value if donation in kind: £1,500 Donor status: individual (Registered 23 June 2017)", "Name of donor: John Armitage Address of donor: private Amount of donation or nature and value if donation in kind: £2,500 Donor status: individual (Registered 23 June 2017)", "Name of donor: 1900 Club Address of donor: 6 Barton Street, London, SW1P 3NG Amount of donation or nature and value if donation in kind: £2,000 Donor status: unincorporated association (Registered 23 June 2017)", "Name of donor: Mr Charles H Gregson Address of donor: private Amount of donation or nature and value if donation in kind: £5,000 Donor status: individual (Registered 23 June 2017; updated 21 August 2017)", "Name of donor: Parking Places Ltd Address of donor: 17 Imperial Square, Cheltenham GL50 1QZ Amount of donation or nature and value if donation in kind: £5,000 Donor status: company, registration 2707973 (Registered 23 June 2017)", "Name of donor: Monica Tyrrell Address of donor: private Amount of donation, or nature and value if donation in kind: £50,000 Donor status: individual (bequest) (Registered 06 October 2017)"], "Land and property portfolio: (i) value over £100,000 and/or (ii) giving rental income of over £10,000 a year": ["Flat in Shepherds Bush: (i) and (ii). (Registered 21 May 2015)", "A third share of a cottage in Gloucestershire: (i) and (ii). (Registered 21 May 2015)", "A third share of a flat in France: (i) and (ii). (Registered 21 May 2015)", "From 6 May 2016 until 19 February 2018, a third share of a house in Gloucestershire: (i). (Registered 11 May 2016; updated 06 March 2018)"]}}, "Sarah Champion": {"2018-06-04": {"Visits outside the UK": ["Name of donor: Government of the Republic of China - Taiwan Address of donor: Taipei Representative Office in the UK, 50 Grosvenor Gardens, Belgravia, London SW1W 0EB Estimate of the probable value (or amount of any donation): Return flights London-Taipei £3,355; accommodation £1,230.77; domestic travel in Taiwan £183.76; food and drink £512.82; total £5,282.35 Destination of visit: Republic of China (Taiwan) Dates of visit: 29 July – 5 August 2017 Purpose of visit: All Party Parliamentary Taiwan Group delegation to discuss political, trade and cultural links between the United Kingdom and Taiwan. (Registered 05 September 2017)", "Name of donor: High Commission of India Address of donor: Aldwych, London WC2B 4NA Estimate of the probable value (or amount of any donation): Air fare costing £1,829; hotel stay costing £1,183; local transport costing £227; £3,239 in total Destination of visit: New Delhi Dates of visit: 5-11 November 2017 Purpose of visit: to develop an understanding of trade and educational opportunities between Britain and India. (Registered 06 December 2017)", "Name of donor: Hong Kong Government Address of donor: c/o Hong Kong Economic & Trade Office, 18 Bedford Square, London WC1B 3JA Estimate of the probable value (or amount of any donation): Airfare £5,975.40; hotel and expenses £1,792.50; local transportation and food £265.62; total £8,033.52 Destination of visit: Hong Kong Dates of visit: 8-12 April 2018 Purpose of visit: To support bilateral relationship and business development between UK and Hong Kong and to gain understanding of Hong Kong's political, social and economic development. (Registered 25 April 2018)"]}}, "Douglas Chapman": {"2018-06-04": {"Gifts, benefits and hospitality from UK sources": ["Name of donor: Exxon Mobil Chemical Ltd Address of donor: Beverkae House, Mossmorran, Cowdenbeath KY4 8EP Amount of donation, or nature and value if donation in kind: Two tickets to a Burns' Supper with a total value of £351.82 Date received: 26 January 2018 Date accepted: 26 January 2018 Donor status: company, registration 1589650 (Registered 19 March 2018)"], "Visits outside the UK"